[
  {
    "id": "Acorus-gramineus-Pusillus",
    "name": "Acorus gramineus 'Pusillus'",
    "url": "https://www.aquasabi.com/Acorus-gramineus-Pusillus",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Grass-leaf sweet flag or Japanese rush, Acorus gramineus, is widespread in East and Southeast Asia. It occurs i.a. at swiftly flowing, rocky forest streams and waterfalls, between pebbles, also clinging on rock by its roots. In these habitats, it is adapted to floods with strong current. Acorus gramineus is an old ornamental plant. There are several cultivars such as the white-striped 'Variegatus'. We offer the dwarf cultivar 'Pusillus' that mostly gets only about 10, at most 15 cm high. It is also named as a variety, Acorus gramineus var. pusillus. Otherwise, wild types of Acorus gramineus may get 30-50 cm tall.",
      "notes": "'Pusillus' is a dwarf form of the Grass-leaf sweet flag or Japanese rush, Acorus gramineus. This cultivated form has also been ranked as a variety, Acorus gramineus var. pusillus. It is in the aquarium trade for a long time, but it is mostly regarded as of limited value or not at all suitable as aquarium plant. However it can very well be grown permanently submerged, at least when it is attached to hard materials (see Schulz 2018).",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Dwarf Sweet Flag",
      "Synonyms": "Acorus gramineus var. pusillus",
      "Trader names": "Acorus pusillus, Acorus pussilus",
      "Complete botanical name": "Ácorus gramíneus Solander",
      "Family": "Acoraceae",
      "Genus": "Acorus",
      "Difficulty": "easy",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks",
      "Growth": "very slow",
      "Temperature tolerance": "4 - 28°C",
      "Propagation": "Rhizomteilung, Splitting, cutting off daughter plants",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Aegagropila-linnaei",
    "name": "Aegagropila linnaei",
    "url": "https://www.aquasabi.com/Aegagropila-linnaei",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This special aquarium plant is called \"moss ball\", however it belongs to the Green Algae. Aegagropila linnaei, also known as Cladophora aegagropila and \"Marimo\", is an extremely slowly growing algae. It occurs in clean lakes where it forms flat cushions as well as hollow balls rolling about the ground, formed by gentle waves in the shore zone.",
      "notes": "folgt (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Marimo",
      "Synonyms": "Conferva aegagropila Linnaeus, Cladophora aegagropila (Linnaeus) Trevisan, Cladophora aegagropila var. linnaei (Kützing) Rabenhorst, Cladophora sauteri (Nees von Esenbeck ex Kützing) Kützing",
      "Complete botanical name": "Aegagropila linnaei Kützing",
      "Family": "Pithophoraceae",
      "Genus": "Aegagropila",
      "Difficulty": "easy",
      "Colour": "dark green",
      "Usage": "Midground, Foreground, group",
      "Height": "3 - 10cm",
      "Width": "3 - 10cm",
      "Growth": "very slow",
      "pH value": "6 - 8",
      "Temperature tolerance": "4 - 28°C",
      "Carbonate hardness": "2 - 18°dKH",
      "General hardness": "9 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Alternanthera-reineckii-Mini",
    "name": "Alternanthera reineckii 'Mini'",
    "url": "https://www.aquasabi.com/Alternanthera-reineckii-Mini",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Alternanthera reineckii 'Mini' is an exquisite dwarf parrot leaf cultivar. It became known in Europe around 2007 under the name Alternanthera reineckii \"rosaefolia minor\". The species A. reineckii is native to wetlands in tropical and subtropical South America, but we have no information about the exact origin of the \"Mini\" form.\nThis plant grows much more compactly under water and also somewhat slower than other A. reineckii forms. It can be pruned to form a beautiful, purple-red to brown-red coloured carpet or compact bush about 5 cm high and is then suitable for the aquarium foreground and nano aquariums. Without pruning, the plant will grow to around 20 cm high over time, but will remain quite bushy due to branching. The leaves can grow to around 5 cm long and 1.4 cm wide, but are often smaller. Many water roots grow on old stems, but these are unlikely to be visually disturbing due to the bushy growth of the plant.\nEmersed Alternanthera reineckii 'Mini' grows significantly taller (at least 30 cm) and more elongated than the submersed form, with longer internodes and more green leaves. Emersed potted plants from the trade therefore hardly differ from other A. reineckii cultivars. However, compact shoots with much shorter internodes develop under water.",
      "notes": "Alternanthera reineckii \"rosaefolia minor\" is an exquisite dwarf form of A. reineckii that forms very low-growing compact bushes when cultivated submersed. It assumes a deep brownish-read colour comparable to A. reineckii 'Rosa' (= \"Rosaefolia\"). This makes it one of the very few red-coloured foreground plants. It got known in Europe around the year 2007; its exact origins are unclear. This plant is likely identical to Alternanthera reineckii 'Mini'. When cultivated emersed, A. reineckii \"rosaefolia minor\" looks pretty much like the emersed forms of other varieties of A. reineckii as it forms rather long stems with elongated internodes. Its stunning dwarfed growth habit with the stunted internodes is reserved for the submersed form, as it seems. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Alternanthera reineckii ''rosaefolia minor''",
      "Complete botanical name": "Alternanthéra reinéckii Briq.",
      "Family": "Amaranthaceae",
      "Genus": "Alternanthera",
      "Difficulty": "medium",
      "Colour": "red brown, crimson, reddish",
      "Usage": "Accent (red), Midground, Nano tanks, Street (Dutch style), Foreground, group",
      "Aquascaping": "well-branched, bushy, very colourful plant for accents",
      "Height": "5 - 30cm",
      "Width": "5 - 10cm",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Anubias-barteri-var-nana-Aquaflora-Pangolino",
    "name": "Anubias barteri var. nana 'Aquaflora Pangolino'",
    "url": "https://www.aquasabi.com/Anubias-barteri-var-nana-Aquaflora-Pangolino",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This attractive Dwarf Anubias selection is produced by the nursery Aquaflora (Netherlands) with the label 'Pangolino', however it differs from the original 'Pangolino that has smaller, narrower leaves. Therefore we call the plant 'Aquaflora's Pangolino'.\nThe plant resembles the new cultivar 'Paxing' but has smaller, somewhat narrower leavs. The narrowly elliptic to lanceolate leaves are glossy, dark green, having an about 3 cm long and 1,4 cm broad blade. Similar to the original 'Pangolino', it has a very compact, dense growth habit. 'Aquaflora's Pangolino' is apparently a little faster growing than 'Pangolino'.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Anubias-barteri-var-nana-Bonsai-Mini-Mini",
    "name": "Anubias barteri var. nana 'Bonsai' ('Mini Mini')",
    "url": "https://www.aquasabi.com/Anubias-barteri-var-nana-Bonsai-Mini-Mini",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Anubias barteri var. nana 'Bonsai' has also entered the trade with the label 'Mini Mini' in recent times. This selection of the Dwarf Anubias looks very similar to 'Petite', however, under the same growth conditions, its ovate leaves stay a little smaller. The leaf blade gets about 18 mm long and 10 mm wide, the petiole about 10 mm. The Bonsai Anubias is as undemanding and robust as the considerably bigger wild type, A. barteri var. nana. It is ideally suited for the hardscape of nano tanks and also provides interesting possibilities for bigger aquariums.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Anubias-barteri-var-nana-Mini-Coin",
    "name": "Anubias barteri var. nana 'Mini Coin'",
    "url": "https://www.aquasabi.com/Anubias-barteri-var-nana-Mini-Coin",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "'Mini Coini' is a really tiny selection of Anubias barteri var. nana. It is still very rare in trade. This plant has round leaf blades similar to 'Round Leaf' aka 'Coin Leaf'. However, they do not exceed a length of 1 cm and are mostly even smaller when they grow under water. This Anubias has a very compact growth habit by intense branching of the rhizome. The leaves are dark to medium green.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Anubias-barteri-var-nana-Pangolino-Green-Tea",
    "name": "Anubias barteri var. nana 'Pangolino Green Tea'",
    "url": "https://www.aquasabi.com/Anubias-barteri-var-nana-Pangolino-Green-Tea",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "'Pangolino Green Tea' is a new selection of the very small-leaved Pangolin Anubias. It has a very light yellow-green hue, hence the name 'Green Tea'. The plant grows very compact, with lanceolate, overlapping leaves, which is why the parent cultivar was named after the pangolin (Scaly anteater).",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bacopa-salzmannii-Purple",
    "name": "Bacopa salzmannii \"Purple\"",
    "url": "https://www.aquasabi.com/Bacopa-salzmannii-Purple",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Purple\" is a spectacular colour form of Salzmann's water hyssop. It apparently came onto the market later than another rather green to reddish form of Bacopa salzmannii, which was first called Bacopa sp. \"Araguaia\". The submerged leaves of Bacopa salzmanniii \"Purple\", on the other hand, develop striking dark reddish-purple tones. The leaf midrib and lateral veins are darker in colour. The shoots grow upright under water and branch little. They grow at least 30 cm high and about 4 cm wide. The underwater leaves are ovate, up to 2.2 cm long and 1.5 cm wide. They form a colour contrast to the rather light green, thick stem.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bolbitis-heudelotii",
    "name": "Bolbitis heudelotii",
    "url": "https://www.aquasabi.com/Bolbitis-heudelotii",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The African water fern is a beautiful, time-tested aquatic fern with transparent bottle green pinnate fronds. It has a wide distribution across tropical Africa, growing attached to rock along the mean waterline of fast-flowing waters, partly together with Anubias species. Also under aquarium conditions, Bolbitis heudelotii attaches itself to solid objects by its blackish roots, but it will also grow when it is fastened to the substrate surface. Just make sure you do not cover the rhizome as it might otherwise rot away.Bolbitis heudelotii is mostly delivered in its emersed (terrestrial) form. The emersed fronds mostly look different to the submerged foliage, and blackish leaf tips or spots are frequent. This does not mean in any way that its vitality is reduced. Good growth conditions provided, the plant will develop new entirely green submerged foliage without dark tips or spots.",
      "notes": "Bolbitis heudelotii (Bory ex FÉE) Alston, or African water fern, is widely distributed in the African tropics. There it grows attached to rocks or driftwood with its roots, in spray zones and inundation areas of rapidly flowing rivers and rivulets. In West Afrika it is often found in the same habitats as Anubias barteri varieties.Very much like Java fern (Microsorum pteropus) and Anubias, Bolbitis heudelotii possesses a creeping rhizome, on which the leaves and roots grow. Its submersed leaves are single to double pinnate, transparent and bottle-green, whereas the emersed leaves are single pinnate, of a matte green, and rather hard. The entire plant is brittle. There seem to be several forms of B. heudelotii in cultivation, which differ a bit even when kept under the same conditions. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Gymnopteris heudelotii Bory ex Fée",
      "Complete botanical name": "Bolbítis heudelótii (Bory ex Fée) Alston",
      "Family": "Dryopteridaceae",
      "Genus": "Bolbitis",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Background, Midground",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 27°C",
      "Carbonate hardness": "0 - 12°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-pygmaea-Bukit-Kelam-Sintang",
    "name": "Bucephalandra pygmaea \"Bukit Kelam / Sintang\"",
    "url": "https://www.aquasabi.com/Bucephalandra-pygmaea-Bukit-Kelam-Sintang",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This form of Bucephalandra pygmaea is found in Bukit Kelam in West Kalimantan and develops dense mats on stream boulders in the tropical rainforest. It is propagated by tissue culture and is available with the labels Bucephalandra sp. 'Wavy Leaf' and 'Green Wavy', also erroneously as B. sp. \"Melawi\". \"Bukit Kelam\" is one of the most known and popular Bucephalandras in the aquarium hobby. This medium-sized Bucephalandra has broadly spathulate, green to brownish-green, quite soft leaves which are about 5 cm long and 2 cm wide. The margin is more or less wavy, the leaf underside is whiteish green.",
      "notes": "(not yet translated into English) (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Bucephalandra motleyana ''Bukit Kelam / Sintang'', Bucephalandra sp. ''Bukit Kelam / Sintang'', Bucephalandra sp. \"Green Velvet\", Bucephalandra sp. ''Wavy Leaf''",
      "Misapplied names": "Bucephalandra cf. motleyana ''Melawi''",
      "Complete botanical name": "Bucephalándra pygmáea (Becc.) P. C. Boyce & S. Y. Wong",
      "Family": "Araceae",
      "Genus": "Bucephalandra",
      "Difficulty": "easy",
      "Colour": "dark green",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks, Foreground, group",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "20 - 26°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Biblis",
    "name": "Bucephalandra sp. \"Biblis\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Biblis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Bucephalandra sp. \"Biblis\" is a very decorative, small to medium sized, relatively vigorous Bucephalandra form. We have no information about its exact origin and species identity, but like all Bucephalandras it comes from the island of Borneo and colonises rocks in the flood zone of streams there. The plant resembles Bucephalandra sordidula. In the aquarium it forms a many-headed group of about 5 - 8 cm high and at least 14 cm wide by branching. The rhizome grows creeping to ascending, is about 2.5 mm thick, at least 4 cm long and branches little. The obovate-lanceolate leaves with conspicuously curled margins grow spreading and clustered like rosettes. The leaf blades are about 4 cm long and 9 mm wide, the petiole is 6 mm long. While the emersed leaves are very dark olive green to reddish brown, the submerged leaves often show splendid dark purple tones. Newly sprouting leaves stand out from the older, dark foliage with their light, brown-orange colouring. In addition, the leaves are covered with many silvery spots (the stomata) under water. Our plant is propagated in nurseries and tissue culture laboratories; it is not commercialised from natural collections.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Brownie-Ghost",
    "name": "Bucephalandra sp. \"Brownie Ghost\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Brownie-Ghost",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Several different Bucephalandra forms are known under the trading name \"Brownie Ghost\". Our plant has elongate-ovate leaves with rounded tip, the leaf edge is more or less wavy. Especially the younger leaves are brown-red with blue-violet iridescence. They get about 3 - 4 cm long. The plant reaches a height of about 5 - 10 cm.. The stomata on the dark coloured leaves are visible as silverish dots.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Kedagang",
    "name": "Bucephalandra sp. \"Kedagang\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Kedagang",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Bucephalandra sp. \"Kedagang\" is a rather small, particularly distinctive form of Bucephalandra. Its species identity and exact location are not known to us, but the trade name \"Kedagang\" probably refers to the town of Kudangan in South Kalimantan. The so-called Bucephalandra sp. \"Mini\" sold as a tissue culture plant is apparently identical to \"Kedagang\".\nThe elongated leaves are approx. 4 to 5.5 cm long and 0.8 to 1.2 cm wide with the petiole, and are overcurved. The petiole is about 0.6 to 1 cm long. The leaf margin is finely curled and bent upwards. The leaves have a very dark brown to green colour with a bluish sheen on the upper side and are covered with silvery dots. The underside of the leaves is silvery-white to pale violet in colour. The rhizome tips and young leaf stalks are wine-red in colour. The rhizome grows creeping to ascending and branches out, forming a multi-headed group over time. This Bucephalandra rarely flowers in the aquarium.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Araceae",
      "Genus": "Bucephalandra",
      "Difficulty": "easy",
      "Colour": "red brown, wine-red, crimson",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks, Foreground, group",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "20 - 26°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Rhizomteilung, Splitting, cutting off daughter plants",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Lamandau-Purple",
    "name": "Bucephalandra sp. \"Lamandau Purple\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Lamandau-Purple",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This beautiful Bucephalandra variant probably comes from the Lamandau region in southwestern Borneo and is propagated in nurseries. It is often labeled as Bucephalandra sp. \"Lamandau\" only.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Red",
    "name": "Bucephalandra sp. \"Red\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Red",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This small to medium-sized Bucephalandra with pretty dark green to reddish brown shades is labelled \"Red\" by the Tropica company. It is produced in nurseries and tissue culture labs. Its exact origin and species identity are unknown to us, but all Bucephalandra species are native to the island of Borneo and occur there as current-adapted plants (rheophytes) on rocks in the flood zone of streams.\nBucephalandra sp. \"Red\" resembles B. sp. \"Theia Green\", but is less compact and grows somewhat slower. In the aquarium it forms spreading to ascending, at least 5 cm long and 3.5 mm thick, strongly branched rhizomes and elongated-elliptical, 4 - 5 cm long, 1.3 cm wide, firm leaves with a round tip. While the emersed leaves are dark olive green, the submerged leaves also show reddish tones and blue-green shimmer. The newly sprouting leaves are light orange-brown to light brown-red, the rhizome tip strong dark brown-red. Under water, the leaves appear densely covered with silvery spots, the stomata. Over time, the plant forms a many-headed group about 8 cm high and at least 18 cm wide through many side branches.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Bucephalandra-sp-Theia-Green",
    "name": "Bucephalandra sp. \"Theia Green\"",
    "url": "https://www.aquasabi.com/Bucephalandra-sp-Theia-Green",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Like practically all Bucephalandras, \"Theia Green\" is primarily a perching plant on rock or wood. However, it can also be attached to the substrate, but do not bury the rhizome because it could rot. The roots will then grow into the substrate by themselves and the plant can benefit from the nutrients in the substrate. The plant develops most beautifully with medium light intensity and a constant supply of CO2 and nutrients. Growth is slow. Bucephalandras are propagated by cutting off side shoots or head shoots, which also promotes branching of the shoots.We recommend to put Bucephalandras into already cycled aquariums. It is best to leave the plants in peace so they can grow. Sudden changes of parameters may lead to shedding of leaves, normally, however, the plants regrow slowly and produce new shoots on the rhizome.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ceratophyllum-demersum-Foxtail",
    "name": "Ceratophyllum demersum 'Foxtail'",
    "url": "https://www.aquasabi.com/Ceratophyllum-demersum-Foxtail",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Ceratophyllum demersum 'Foxtail' is a decorative form of the Rigid Hornwort that was found during a Tropica expedition in a small tributary of the Guaporé river at the border between Brazil and Bolivia.As well as the long known normal Ceratophyllum demersum it is a very fast growing plant. The Rigid Hornwort or Coontail has a nearly worldwide distribution, especially in nutrient-rich waters. Ceratophyllum species do not have roots, they grow planted in the ground as well as free floating below the surface.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ceratopteris-cornuta",
    "name": "Ceratopteris cornuta",
    "url": "https://www.aquasabi.com/Ceratopteris-cornuta",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Ceratopteris cornuta is a water sprite species with markedly broader leaf lobes than the much more filigree \"Sumatra fern\". This medium large aquatic fern grows as submerged, rooted plant as well as free-floating plant. It gets at least 30 cm tall. On nutrient-rich, wet bottom it develops emersed spore-bearing leaves that become considerably longer than the submerged ones.",
      "notes": "The water sprite Ceratopteris cornuta has been placed in the species C. thalictroides by various authors. In aquaristics, however, those forms with more coarsely pinnate/lobed leaves are known under the name of C. cornuta, and those with more finely pinnate leaves as C. thalictroides.Ceratopteris richardii is quite similar to C. cornuta and can only safely be discerned by close examination of the spores. This species is used as model organism in plant genetics. It is even possible that C. richardii is kept in the hobby, however, that it is mistaken for C. cornuta.Like Ceratopteris thalictroides, C. cornuta can be planted in the substrate as well as cultivated as a floating plant. To be continued ... (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Pteris cornuta P. Beauv., Ceratopteris thalictroides (L.) Brongn. f. cornuta (P. Beauv.) Glück",
      "Complete botanical name": "Ceratópteris cornúta (P. Beauv.) Le Prieur",
      "Family": "Pteridaceae",
      "Genus": "Ceratopteris",
      "Difficulty": "medium",
      "Usage": "Background, Plant for spawning, Midground, Specimen plant, Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating leaves, Spores",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ceratopteris-pteridoides",
    "name": "Ceratopteris pteridoides",
    "url": "https://www.aquasabi.com/Ceratopteris-pteridoides",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Floating antler-fern is very different from its relatives Ceratopteris thalictroides and C. pteridoides. This conspicuous, large floating fern occurs from the southeastern U.S. to South America and is also reported from Southeast Asia. Ceratopteris pteridoides grows in rivers and standing waters, either free-floating with water roots or as swamp plant, rooting in mud. It does not thrive under water. In the aquarium hobby this species is often confused with Ceratopteris cornuta that is able to grow submerged. \nThe triangular to lobed floating leaves may exceed 13 cm in length. With much light and nutrients, this fern may develop its very different fertile, spore-bearing leaves that are emersed, finely divided and have a very thick, inflated stalk. Many young plantlets (adventitious plantlets) form on older  floating leaves.",
      "notes": "Floating antlerfern, or Ceratopteris pteridoides, is distrubuted from the American subtropicst and tropics from Florida and Louisiana on southward and has also been found in Vietnam.It does not grow submersed, but only floating on water and as bog plant on muddy ground. Form and size vary, depending on the conditions of the location it grows in.The floating leaves of young plants are entire, those of older, larger plants have broad lobes. Their outline is a wide triangle. On older leaves, many young plants form from bulblets in the deep crevices of the lobes.The leaf stalks are thick and widen even more towards the leaf blade; they consist of spongiform tissue and serve as buoys. (The leaf stalks of Ceratopteris cornuta and C. thalictroides, however, are relatively thin and of an even width.) The leaf lobes of C. pteridoides are mostly oppsite, whereas those of C. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Parkeria pteridoides Hooker, Ceratopteris lockhartii (Hook. & Grev.) Kunze",
      "Misapplied names": "Ceratopteris cornuta, Ceratopteris froesii",
      "Complete botanical name": "Ceratópteris pteridoídes (Hooker) Hieronymus",
      "Family": "Pteridaceae",
      "Genus": "Ceratopteris",
      "Difficulty": "medium",
      "Usage": "Plant for spawning, Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating leaves, Spores",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ceratopteris-thalictroides",
    "name": "Ceratopteris thalictroides",
    "url": "https://www.aquasabi.com/Ceratopteris-thalictroides",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Water Sprite or Fine leaf Indian fern is a highly decorative, fast growing fern that’s suitable as solitary plant in larger tanks. It is also labeled Ceratopteris siliquosa and C. thalictroides \"Fein\". Its leaves are large, finely dissected fronds, getting about 30 - 50 cm long and up to 30 cm wide.",
      "notes": "Ceratopteris thalictroides is an amphibic fern found in many tropical regions of the world in shallow waters and on muddy ground, amongst others in rice paddies. In some tropical regions of Asia the emersed leaves of this species are used as vegetable. In nature, this plant is said to be an annual plant, however, it can be cultivated over several years without problems. The species contains many local forms, and in aquaristics, varietys with more coarsely or finely pinnate submersed leaves are common (photos 1 to 3 show an especially delicate form of C. thalictroides). The species has been known in the hobby for many years, also under the synonym of Ceratopteris siliquosa as well as under the vernacular names of water sprite, Indian fern, Oriental waterfern and water hornfern. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Acrostichum thalictroides L., Ceratopteris froesii Brade, Ceratopteris gaudichaudii Brongn., Ceratopteris siliquosa (L.) Copel.",
      "Complete botanical name": "Ceratópteris thalictroídes (L.) Brongn.",
      "Family": "Pteridaceae",
      "Genus": "Ceratopteris",
      "Difficulty": "medium",
      "Usage": "Background, Plant for spawning, Midground, Specimen plant, Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating leaves, Spores",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Cryptocoryne-parva",
    "name": "Cryptocoryne parva",
    "url": "https://www.aquasabi.com/Cryptocoryne-parva",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Cryptocoryne parva is the smallest Crypt. It is native to Sri Lanka where it grows at the edges and in the shallow water of fast flowing rivers. It forms dense, extended lawns with its underground runners. This species forms the hybrid Cryptocoryne x willisii with species from the same area such as C. beckettii. It is known in the aquarium hobby for a long time and belongs to the standard range of the water plant nurseries. In its terrestrial form, the Small Water Trumpet gets to about 10 cm high, but it reaches mostly 2 to 5 cm under aquarium conditions. Its leaves are coarse and medium to dark green. The emersed plants have broadly lanceolate leaf blades while the submerged leaves are considerably narrower. With strong lighting, the leaves tend to spread horizontally where they are rather upright when shaded. Otherwise it is one of the few Cryptocoryne whose leaf colour and shape does not change significantly when the environment changes.",
      "notes": "Cryptocoryne parva, the smallest known water trumpet species, has its origins in the central highlands of Sri Lanka near Kandy city. It grows in dense colonies on riverbanks there. Recently it has been scarcely collected in the wild, and it is possibly to be considered an endangered species. In aquaristics, it has been known for a long time but hasn't been very widely spread, mostly due to its really slow growth. However, it is easily available in trade or from other hobbyists.The dwarf water trumpet is quite similar to those plants from the group of plants related to Cryptocoryne x willisii. Under comparable conditions it tends to stay smaller than those, as a submersed, non-flowering plant it is hard to be discerned safely from them, though. Earlier on, the name \"Cryptocoryne nevillii\" was used for both C. parva and C. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Cryptocóryne párva de Wit",
      "Family": "Araceae",
      "Genus": "Cryptocoryne",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "very slow",
      "pH value": "5 - 8",
      "Temperature tolerance": "15 - 28°C",
      "Carbonate hardness": "1 - 18°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Cryptocoryne-spiralis-Red",
    "name": "Cryptocoryne spiralis 'Red'",
    "url": "https://www.aquasabi.com/Cryptocoryne-spiralis-Red",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Spiral water trumpet from southwestern India is an extremely polymorphic species. With 'Red' and 'Tiger', two new beautiful forms have entered the market few years ago.  They are still rarely available in Europe. As submerged plant, Cryptocoryne spiralis 'Red' forms dark brown-red, strap-shaped leaves with smooth to curled margin. The midrib is mostly lively green and contrasts nicely with the brown-red rim with darker marbling. Under the same conditions, the leaves of the 'Red' have a narrower shape and get longer than those of Cryptocoryne spiralis 'Tiger' that often lacks the green midrib and has a more pronounced stripe pattern. Until now, the longest leaves of Cryptocoryne spiralis 'Red' have reached a length of about 34 cm, however the plant may get considerably taller with time.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Cryptocoryne-wendtii-Green",
    "name": "Cryptocoryne wendtii \"Green\"",
    "url": "https://www.aquasabi.com/Cryptocoryne-wendtii-Green",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A green variant of time-tested easy-to-cultivate very variable Cryptocoryne wendtii.",
      "notes": "folgt (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Cryptocóryne wéndtii de Wit",
      "Family": "Araceae",
      "Genus": "Cryptocoryne",
      "Difficulty": "easy",
      "Usage": "Midground, Foreground, group",
      "Growth": "medium",
      "pH value": "5 - 8",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "1 - 18°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Cyperus-helferi",
    "name": "Cyperus helferi",
    "url": "https://www.aquasabi.com/Cyperus-helferi",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The only flatsedge species used as submersed aquarium plants. Cyperus helferi grows long leaves that sway gently in the current.",
      "notes": "The genus Cyperus (papyrus sedges) comprises about 900 species, among them the African papyrus (Cyperus papyrus) and the well-known houseplant C. alternifolius. However, there are only a few Cyperus species that can truly grow submersed, among them Cyperus helferi. This aquatic plant is found submersed as well as emersed in Thailand, in stagnant and slow-flowing waters. This Cyperus species is not very difficult in cultivation, given that it survives it rather long adaptation period. It grows best under lots of light (0.5 - 1 watt per litre). There is no need to fertilise with CO2, however, if CO2 is added it enhances growth significantly. This plant likes its water on the cooler side, thus a temperature of 26 °C should not be exceeded for optimal growth. A good supply of nitrate, phosphate, potassium and micronutrients enhance growth and further a healthy look.C. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Cypérus hélferi Boeckeler",
      "Family": "Cyperaceae",
      "Genus": "Cyperus",
      "Difficulty": "medium",
      "Usage": "Background, Midground, Specimen plant",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating inflorescences, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Echinodorus-grisebachii-Bleherae",
    "name": "Echinodorus grisebachii 'Bleherae'",
    "url": "https://www.aquasabi.com/Echinodorus-grisebachii-Bleherae",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Broadleaf Amazon Sword from tropical South America is one of the most known and popular aquarium plants. Cultivated for many years, it was first introduced under the misapplied name \"Echinodorus paniculatus\", later it was called Echinodorus bleheri for a long time. Its leaves are wider (3-6 cm) than those of E. grisebachii 'Amazonicus' and up to 60 cm long, lending the plant a more dominant appearance. It is mostly delivered in its terrestrial form, with longer leaf stalks and shorter leaf blades (see the photo). After planting into the aquarium, it will develop much more elongate, short stalked submerged leaves.",
      "notes": "The origins of this Echinodorus are very much in the dark - it may be native to Amazonia, though. Like E. grisebachii 'Amazonicus' and E. g. 'Parviflorus' it belongs to the group of plants related to Echinodorus grisebachii, which is widely distributed in tropical America. E. g. 'Bleherae' was long erroneously known under the trade name Echinodorus paniculatus (and sometimes still is). The true E. paniculatus is a totally different plant not found in the hobby very often.The different forms of the E. grisebachii group grow amphibic in their specific locations, growing submersed for a long time of the year. They only grow emersed leaves and flower stalks after falling dry during the low-water season. In the aquarium, they also remain below the waterline and only transform into the land form after being taken out of the water.  E. grisebachii 'Bleherae', commonly known as E. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Broadleaved Amazon Swordplant",
      "Synonyms": "Echinodorus bleherae Rataj, Echinodorus bleheri Rataj",
      "Misapplied names": "Echinodorus paniculatus",
      "Trader names": "Echinodorus rangeri",
      "Complete botanical name": "Echinódorus grisebáchii Small",
      "Family": "Alismataceae",
      "Genus": "Echinodorus",
      "Difficulty": "easy",
      "Usage": "Background",
      "Growth": "fast",
      "Temperature tolerance": "18 - 30°C",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating inflorescences, Rhizomteilung",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Egeria-najas",
    "name": "Egeria najas",
    "url": "https://www.aquasabi.com/Egeria-najas",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Egeria najas is an undemanding anacharis species that is not yet that familiar in the aquarium hobby as Egeria densa. Like this species, it is native to the southern part of South America (Argentina, Uruguay, Paraguay, Brazil), but its range stretches farther to the north, into the tropical zone of Brazil. This true submerged plant occurs in various flowing and standing waters. The plant has a more delicate appearance than Egeria densa; the leaves are narrower, with clearly visible teeth on the edges. The shoots are densely set with leaves and about 2-3 cm wide.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Narrow-leaf Anacharis",
      "Complete botanical name": "Egéria nájas Planch.",
      "Family": "Hydrocharitaceae",
      "Genus": "Egeria",
      "Difficulty": "very easy",
      "Usage": "Background, Midground",
      "Growth": "very fast",
      "pH value": "5 - 9",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 20°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Cuttings",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Elatine-hydropiper",
    "name": "Elatine hydropiper",
    "url": "https://www.aquasabi.com/Elatine-hydropiper",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Elatine hydropiper was brought into trade as an aquarium plant in Jahr 2010 by the aquatic plant nursery Anubias. This plant has soon gained a lot of popularity with aquascapers as wonderful ground-covering plant. It looks like a miniature version of Glossostigma elatinoides. Whereas G. elatinoides can become quite invasive under good conditions, Elatine hydropiper grows only moderately and is thus much easier to handle.",
      "notes": "Elatine hydropiper was brought into trade by Anbias plant company in 2010. Presumably the aquarium population of this plant was originally collected in Italy (Adams 2010). Whether it is really E. hydropiper should be verified by means of flowering and fruiting plants. Elatine hydropiper is widely distributed in Europe up to northern Scandinavia as well as in Siberia and Northern China. In Italy it only grows in the north-west. This species grows in and on ponds, rivers and marshes. The area of distribution reaches very far north, which makes it rather astonishing that the aquarium population of E. hydropiper grows so well in tropical tanks. In the south of Italy and in other regions of the Mediterranean, two more species that look very much like E. hydropiper: Elatine macropoda, which is mentioned in old aquarium literature, and E. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Eight-stamen waterwort",
      "Complete botanical name": "Elatíne hydrópiper L.",
      "Family": "Elatinaceae",
      "Genus": "Elatine",
      "Difficulty": "difficult",
      "Usage": "Nano tanks, Foreground, ground cover",
      "Aquascaping": "forms a small-leaved carpet",
      "Growth": "medium",
      "pH value": "6 - 7",
      "Temperature tolerance": "4 - 26°C",
      "Carbonate hardness": "4 - 8°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Eleocharis-acicularis",
    "name": "Eleocharis acicularis",
    "url": "https://www.aquasabi.com/Eleocharis-acicularis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Needle spikerush or Hair grass is a classic aquarium plant and one of the most beautiful turf-forming plant species with its almost hair-thin, medium-green culms. It is native to Europe as well as Asia, North, Central and South America and, as an amphibious plant, colonises open, occasionally flooded fine sandy soils, e.g. on and in lakes and ponds, in swamps and wet ditches. Very thin underground runners develop into a dense turf, which grows to a height of around 2 to 10 cm in the terrestrial form and sometimes up to 30 cm in the submerged form. In the aquarium, the Needle spikerush usually grows to a height of around 10 to 20 cm, in contrast to Eleocharis pusilla or E. sp. \"Mini\" at around 5 to 10 cm.",
      "notes": "Eleocharis acicularis, commonly known as dwarf hairgrass or spikerush, is distributed almost globally. It can be found on the edges of ponds and in shallow water in Central Europe, too. It has been known as aquarium plant for a very long time and is also on sale as pond plant quite regularly.The hairlike, thin and rather upright leaves of the submersed form are of a medium green and grow to a length of about 10 to 20 cm.Eleocharis pusilla (often sold under the name \"E. parvula\") is quite similar to E. acicularis, but its submersed form stays smaller (grows only 5 cm high) and is of a light green colour under the same conditions, and its leaves are bent.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Eleócharis aciculáris (L.) Roem. & Schult.",
      "Family": "Cyperaceae",
      "Genus": "Eleocharis",
      "Difficulty": "easy",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 27°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Eleocharis-sp-Mini",
    "name": "Eleocharis sp. 'Mini'",
    "url": "https://www.aquasabi.com/Eleocharis-sp-Mini",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The dwarf hairgrass, also known as Eleocharis acicularis 'Mini', Eleocharis sp. \"Belem\" as well as the name Eleocharis pusilla, probably originates from the Belém area in Brazil. It stays lower than the Needle Spikerush, E. acicularis, and  the plant that is traded as \"Eleocharis parvula\". It is one of the most popular lawn-forming plants in aquascaping. Although its culms may reach a length of about 10 cm, it is perfectly suited for an only 3-6 cm high, dense, lush, freshly green lawn. Its almost hair-thin, light green culms are typically arching and appear on many thin underground runners.",
      "notes": "(not yet translated into English) (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Eleocharis sp. ''Belém''",
      "Family": "Cyperaceae",
      "Genus": "Eleocharis",
      "Difficulty": "easy",
      "Colour": "light green",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Height": "3 - 7cm",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 27°C",
      "Carbonate hardness": "0 - 14°dKH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Eriocaulon-sp-Feather-Duster",
    "name": "Eriocaulon sp. \"Feather Duster\"",
    "url": "https://www.aquasabi.com/Eriocaulon-sp-Feather-Duster",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Eriocaulon sp. \"Feather Duster\" is an unusual plant of unknown origin. We suspect that it comes from the Indian subcontinent. It looks similar to Eriocaulon sp. ‘Japan Needle Leaf’, but has a much finer structure; the plant forms narrower leaves, only approx. 1 mm wide, which are not arranged in two rows but spirally on the rhizome. The rhizome branches out, forming a dense cluster of many individual shoots over time. The fine, flexible leaves are just over 30 cm long. If the plant grows in shallow water, relatively large head-shaped inflorescences with countless small grey-white flowers can push themselves above the surface of the water. The leaves remain submerged. Unlike \"Japan Needle Leaf\", \"Feather Duster\" does not form adhesive roots on hard materials and therefore cannot grow as a perching plant.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Eriocaulon-sp-Japan-Needle-Leaf",
    "name": "Eriocaulon sp. \"Japan Needle Leaf\"",
    "url": "https://www.aquasabi.com/Eriocaulon-sp-Japan-Needle-Leaf",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This remarkable grass-like plant was brought onto the market in Asia under the name Eriocaulon sp. \"Japan\", however, in the hobby, several different Eriocaulon variants are known under that name. Its species identity is still unclear. It is certainly not native to Japan and resembles certain Eriocaulon species that occur in rocky beds of fast-flowing rivers in India. Its submerged leaves are flexible, dark green and smooth. They grow to a length of approx. 30-40 cm with a width of only 1.5 mm. The leaves are distichous, which means that they grow in two rows on the rhizome - quite uncommon for an Eriocaulon. The creeping, short, hard rhizome branches readily, forming a large, dense grass-like tuft with time. Sometimes, young leaves get stuck when sprouting and become wrinkled. They can be removed and are normally followed by straight leaves.\nInterestingly, this Eriocaulon attaches itself to solid material such as rock or wood. Therefore it seems likely that it occurs naturally on rock or in gravel in flowing waters.\nOccasionally inflorescences appear that remain shorter than the leaves. When they are able to grow out of shallow water, its flowerheads open, exposing many tiny greyish white flowers. When the heads remain submerged, they develop adventitious plantlets.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Eriocaulon sp. 'from Japan'",
      "Family": "Eriocaulaceae",
      "Genus": "Eriocaulon",
      "Difficulty": "medium",
      "Usage": "Background, Midground, Specimen plant",
      "Height": "20 - 40cm",
      "Width": "5 - 20cm",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "21 - 26°C",
      "Carbonate hardness": "0 - 12°dKH",
      "Propagation": "Proliferating inflorescences, Splitting, cutting off daughter plants",
      "Can grow emersed?": "unknown",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Fissidens-fontanus-Phoenix-Moss",
    "name": "Fissidens fontanus \"Phoenix Moss\"",
    "url": "https://www.aquasabi.com/Fissidens-fontanus-Phoenix-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Fissidens fontanus is a delicate feathery dark green aquatic moss clinging to driftwood or rocks with its rhizoids, forming roundish cushions or lawn-like populations. It is also known under the synonym Octodiceras fontanum and in the trade as \"Fissidens geppii\". We cultivate two variants of this species, which differ in size when growing in the same environment. The smaller variant is what we call \"Phoenix moss\". It develops around 3 to 5 mm long leaflets, is of a somewhat darker green and has an overall more delicate growth habit and looks more compact as it branches more readily than the larger variant.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Phoenix moss",
      "Synonyms": "Fissidens debilis Schwägr., Fissidens julianus (Savi ex DC.) Schimp., Fissidens mexicanus (Müll. Hal.) Mitt., Fissidens tuerckheimii (Müll. Hal.) Broth., Fontinalis juliana Savi ex DC., Octodiceras dillenii (Bach. Pyl.",
      "Misapplied names": "Fissidens geppii, Fissidens nobilis",
      "Complete botanical name": "Fissidens fontánus (Bach. Pyl.) Steudel",
      "Family": "Fissidentaceae",
      "Genus": "Fissidens",
      "Difficulty": "difficult",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks, Foreground, group",
      "Aquascaping": "fine-leaved",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 26°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "unknown",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Fissidens-nobilis",
    "name": "Fissidens nobilis",
    "url": "https://www.aquasabi.com/Fissidens-nobilis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Fissidens nobilis is a very decorative, large moss. This striking Fissidens species is widespread in warm-temperate to tropical Asia, from India to Japan, Indonesia and the Fiji Islands. It colonises damp locations such as trickling rock faces and stream banks. The botanical name could be translated as \"Noble pocket moss\". \nThe feather-like, rigid shoots are approximately 3–5 mm wide, up to several centimetres long, deep medium to dark green and densely covered with leaves. In the terrestrial form, the shoots grow creeping to ascending. Although F. nobilis is not naturally an aquatic moss, it can grow underwater. The submerged shoots grow ascending to upright, are usually slightly narrower than in the terrestrial form, but equally rigid.\nIn the aquarium hobby, the name F. nobilis is sometimes mistakenly used for other species, such as Fissidens fontanus, which is very different from F. nobilis.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Fissidens-sp-Vietnam",
    "name": "Fissidens sp. \"Vietnam\"",
    "url": "https://www.aquasabi.com/Fissidens-sp-Vietnam",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This interesting new variety of Fissidens moss forms velvety, deeply green carpets of small, compact shoots. The feather-like, soft shoots are about 3-4 mm wide, branched at the base and have a decumbent to ascending growth habit. This Fissidens thrives above as well as under water, however it seems to prefer submerged life. In this respect it resembles Fissidens sp. \"Mallorca\", however its single shoots are a little more delicate. It is also similar to the dwarfish Fissidens sp. \"Khao Sok\" from Thailand, but according to our experience it grows considerably better under aquarium conditions. Because of its trading name, this yet unidentified, small Fissidens was probably found in Vietnam.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Glossostigma-elatinoides",
    "name": "Glossostigma elatinoides",
    "url": "https://www.aquasabi.com/Glossostigma-elatinoides",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Glossostigma elatinoides is a very popular plant for Japanese-style tanks. It is one of the smallest aquarium plants, which makes it ideal for the foreground. A difficult-to-care-for plant that needs a lot of light. If the lighting is too weak, it tends to grow upwards. Must not be shaded off by larger plants. When planting, make small tufts (approx. 1/8 of the pot) and plant at a distance of only a few centimetres. Thus you will get a ground-covering group in less time. The injection of CO2 and soft water enhance growth considerably.",
      "notes": "Glossostigma elatinoides is a very low-growing lawnlike aquarium plant with creeping runners and spatula-like leaves that grows emersed to totally submersed in bogs and flood areas as well as on river banks and lakeshores in its native habitats in Australia, Tasmania and New Zealand. Takashi Amano became aware of the hitherto rather unknown plant in 1980. He imported it to Japan via the aquatic plant nursery Dennerle and created the first Nature Aquaria layouts with low-growing carpets of Glossostigma. Meanwhile, Glossostigma elatinoides has become one of the most popular foreground plants in all the world.It is possible to confound Glossostigma elatinoides with small submersed waterclovers (Marsilea). However, the creeping runners of Glossstigma have opposing leaves (2 leaves per node), those of Marsilea are alternate (1 leaf per node). (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Small mud-mat, Glosso",
      "Synonyms": "Tricholoma elatinoides Bentham",
      "Complete botanical name": "Glossostigma elatinoides (Benth.) Hook. f.",
      "Family": "Phrymaceae",
      "Genus": "Glossostigma",
      "Difficulty": "difficult",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a small-leaved carpet",
      "Growth": "fast",
      "pH value": "4 - 7",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Helanthium-bolivianum-Latifolius",
    "name": "Helanthium bolivianum \"Latifolius\"",
    "url": "https://www.aquasabi.com/Helanthium-bolivianum-Latifolius",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Also known as Echinodorus latifolius. Medium-sized chain sword, not demanding. It develops runners with many plantlets and is suitable as a lawn in the foreground of larger tanks or as group in the midground of smaller tanks. The submerged leaves are linear, light green, about 1 cm wide and ca. 10-30 cm long.",
      "notes": "This plant has been known under the name Echinodorus latifolius for many years. It belongs to the group of Helanthium bolivianum (= Echinodorus bolivianus). It is often found in trade under other names, like \"Echinodorus magdalenensis\", however, those names might also refer to other varieties of Helanthium bolivianum.As a submersed plant, Helanthium bolivianum \"latifolius\" is hard to discern from other plants from the group of H. bolivianum. Its leaf rosettes have an overall stiffer apperance than those of e.g. H. bolivianum \"quadricostatus\" (Echinodorus quadricostatus).Its emersed form has narrowly lanceolate leaf blades with an acute tip (see picture 3), very much like emersed plants of Helanthium tenellum and H. bolivianum \"angustifolius\".The petals of its flowers are slanting downwards (see fig. 92).- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Echinodorus latifolius (Seub.) Rataj",
      "Complete botanical name": "Helánthium boliviánum (Rusby) Lehtonen & Myllys",
      "Family": "Alismataceae",
      "Genus": "Helanthium",
      "Difficulty": "easy",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "10 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Helanthium-bolivianum-quadricostatus",
    "name": "Helanthium bolivianum \"quadricostatus\"",
    "url": "https://www.aquasabi.com/Helanthium-bolivianum-quadricostatus",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "In the aquarium hobby, relatively small, turf-forming plants have long been known under various names such as Echinodorus quadricostatus, E. magdalenensis and E. xinguensis. These \"chain swords\" from the Helanthium bolivianum complex originate from tropical Central and South America. As amphibious plants, they colonise periodically flooded banks of rivers, lakes and ponds as well as swampy places. In the terrestrial form they have stalked, lanceolate leaves and small white flowers, in the submerged form they have narrower, almost grass-like leaves.\n The plant we offer as Helanthium bolivianum \"quadricostatus\" has formed a turf about 10 - 13 cm high in our aquariums; Tropica states a growth height of 10 - 15+ cm. The light green, soft underwater leaves are linear-lanceolate and about 8 - 9 mm wide. It spreads rapidly by long chains of runners that creep along the ground, forming a lush, bright green turf.",
      "notes": "The name \"Echinodorus quadricostatus\" is a trade name for various varieties of Helanthium bolivianum. In addition, it is also found under further denominations like Echinodorus magdalenensis (= E. quadricostatus var. magdalenensis), E. xinguensis (= E. quadricostatus var. xinguensis), E. bolivianus or \"Echinodorus grisebachii\" in the trade. One of these forms only grows to under 5 cm in height when cultivated submersed, which makes it an ideal rapidly growing foreground ground cover. Another variety grows as vigorously, but to a height of over 20 cm.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Echinodorus magdalenensis",
      "Complete botanical name": "Helánthium boliviánum (Rusby) Lehtonen & Myllys",
      "Family": "Alismataceae",
      "Genus": "Helanthium",
      "Difficulty": "easy",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "10 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Helanthium-tenellum-Red",
    "name": "Helanthium tenellum (\"Red\")",
    "url": "https://www.aquasabi.com/Helanthium-tenellum-Red",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Small foreground plants for aquariums are in short supply, but Helanthium tenellum (= Echinodorus tenellus) is one of the best. The submerged leaves are very narrow and light-, middle-, olive-green to reddish. It differs from the always light green Helanthium tenellum \"parvulum\" by darker, often reddish coloration and narrower leaves. The runners spread round the aquarium. A true \"lawn'' effect appr. 5-10 cm tall is only achieved at high light intensities, so you must make sure larger plants do not overshadow the plant. Plant individual plants a couple of centimetres apart (easiest with tweezers). A nutritious bottom promotes growth.",
      "notes": "Helanthium tenellum, the pygmy chain sword, is still also known under its synonym Echinodorus tenellus. It is the smallest known species among the runner-forming sword plants, and rather variable. The variety usually found in trade originates from the American tropics (Brazil?). Its submersed leaves are very narrow, pointed,  and of a medium to olive green or even reddish. They grow to a length of 6 to 10 cm, sometimes even longer, and a width of about 1.5 mm. Their widest part lies above the middle, around 2 cm below the tip.The submersed leaves of another form originating from North America (see Helanthium tenellum \"parvulum\"), though rarely cultivated today, has always light green leaves that are not as narrow, with  around 2 mm width.  They have their widest part below the middle. - To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Helánthium tenéllum (Mart. ex Schult.f.) J.G.Sm.",
      "Family": "Alismataceae",
      "Genus": "Helanthium",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "10 - 35°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Helanthium-tenellum-green",
    "name": "Helanthium tenellum \"green\"",
    "url": "https://www.aquasabi.com/Helanthium-tenellum-green",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This light green lawn-forming Helanthium (Chain sword) is great for aquascaping. It is also sold under the names Echinodorus tenellus, E. tenellus \"Green\" and Helanthium tenellum \"Broad Leaf\".",
      "notes": "Helanthium tenellum \"parvulum\" is a light green, usually smaller and wider-leaved form of Helanthium tenellum (= Echinodorus tenellus). It was probably first imported from North America. Decades ago, this was the aquarium plant generally known as Echinodorus tenellus, today it is only rarely cultivated any more. Its submersed leaves are always light green, never reddish, up to a little over 2 mm wide and widest below the middle.The plant usually sold under the name H. tenellum today was imported from the American tropics (Brazil?), and its submersed leaves are generally of an olive green to reddish colour, longer and narrower (up to around 1.5 mm) that are widest above the middle (see Helanthium tenellum). Its emersed, flowering form also differs clearly from H. tenellum \"parvulum\".A well-growing clone of H. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Echinodorus parvulus Engelm., Helanthium parvulum (Engelm.) Small, Echinodorus tenellus,  nordamerikanische Form, Echinodorus tenellus 'Broad Leaf', Helanthium tenellum 'Broad Leaf', Echinodorus tenellus 'Green'",
      "Misapplied names": "Ranalisma rostrata",
      "Complete botanical name": "Helánthium tenéllum (Mart. ex Schult. f.) J. G. Sm.",
      "Family": "Alismataceae",
      "Genus": "Helanthium",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "10 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hemianthus-callitrichoides-Cuba",
    "name": "Hemianthus callitrichoides \"Cuba\"",
    "url": "https://www.aquasabi.com/Hemianthus-callitrichoides-Cuba",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Hemianthus callitrichoides is one of the world's smallest aquarium plants. It was originally imported by Holger Windelov, who found it in a riverbed on Cuba, to the west of Havana. Its delicate stems with the tiny roundish to ovoid leaves have a creeping growth habit. When planted in small tufts at a distance of a few centimetres, the plant will soon spread and form an uninterrupted carpet. Hemianthus callitrichoides is an attractive foreground plant for small as well as large tanks.",
      "notes": "[unveränderte Übersetzung]",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Dwarf baby tears",
      "Complete botanical name": "Hemiánthus callitrichoídes Griseb.",
      "Family": "Linderniaceae",
      "Genus": "Hemianthus",
      "Difficulty": "difficult",
      "Colour": "light green",
      "Texture": "kleinblättrig, kurzblättrig",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 28°C",
      "Carbonate hardness": "0 - 18°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hydrocotyle-tripartita-Mini",
    "name": "Hydrocotyle tripartita \"Mini\"",
    "url": "https://www.aquasabi.com/Hydrocotyle-tripartita-Mini",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This remarkable pennywort from Australia was previously unknown in Europe. Its leaves are about half the size of normal Hydrocotyle tripartita.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hydropogonella-gymnostoma",
    "name": "Hydropogonella gymnostoma",
    "url": "https://www.aquasabi.com/Hydropogonella-gymnostoma",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Queen moss is one of the very few aquarium mosses from tropical America. It was first introduced as \"Amblystegiaceae sp. Manaus\" and later determined as Hydropogonella gymnostoma by a Japanese moss expert. It is a true water moos which colonizes in its natural area - Central and South America - substrates in waters such as tree trunks and stones. Until now, the Queen moss is quite rare in the aquarium hobby.",
      "notes": "(not yet translated into English) (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Queen moss",
      "Synonyms": "Fontinalis gymnostoma Schimp.",
      "Misapplied names": "Amblystegiaceae sp. ''Manaus''",
      "Complete botanical name": "Hydropogonélla gymnóstoma (Schimp.) Cardot ex Le Jol.",
      "Family": "Sematophyllaceae",
      "Genus": "Hydropogonella",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "medium",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hygrophila-lancea-Chai",
    "name": "Hygrophila lancea 'Chai'",
    "url": "https://www.aquasabi.com/Hygrophila-lancea-Chai",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "'Chai' is a striking variegated cultivar of Hygrophila lancea \"Araguaia\" that occurred at South Island Aquarium in Singapore. It is still rarely available in Europe. Its narrowly linear, curved leaves have a green zone in the middle while the edge is white to pink. Its colour tones resemble Cryptocoryne wendtii 'Flamingo' and 'Pink Panther'. As well as normal \"Araguaia\", submerged Hygrophila lancea 'Chai' has a rather spreading and ramified growth habit.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hygrophila-pinnatifida",
    "name": "Hygrophila pinnatifida",
    "url": "https://www.aquasabi.com/Hygrophila-pinnatifida",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Hygrophila pinnatifida from India grows unique lobed leaves with olive green, leathery brown to brownish-red upper side with a light yellow pattern in the aquarium. The underside is wine red. The plant grows horizontal lateral shoots whose roots will cling to rocks or driftwood. It has only been cultivated in aquaria since 2008, today it is a very popular plant with manifold uses in aquascaping. When the top shoots are trimmed regularly, the plant maintains its compact growth habit. If the shoot tops aren't cut off, the stems grow high and upright with long leaves. When planted in smaller groups in front of a calm background, the plant's growth habit and colour are a nice eye-catcher.",
      "notes": "Hygrophila pinnatifida is an uncommon hygro endemic to India. There it grows on rivulets in the western coastal area on the foot of the Western Ghats (Maharashtra, Goa, Karnataka, Tamil Nadu), and in literature, findings of this plant are also documented for the north-Indian state Uttar Pradesh.   H. pinnatifida has been known to science for over 150 years, however, it has only been cultivated as aquarium plant since early 2008. Up to now (2010) it is still relatively rare in the hobby, however, some large aquatic plant nurseries have already taken it into their product range as novelty. This plant differs from the Hygrophila species hitherto kept in aquaria in many respects. Its leaves of the emersed as well as the submersed form are pinnatilobed to pinnatisect and are thus highly decorative. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Nomaphila pinnatifida Dalzell, Cardanthera pinnatifida (Dalzell) Benth. ex C.B.Clarke .",
      "Complete botanical name": "Hygróphila pinnatífida (Dalzell) Sreem.",
      "Family": "Acanthaceae",
      "Genus": "Hygrophila",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Semi-emersed plant for open tanks, Midground, Foreground, group",
      "Height": "5 - 40cm",
      "Width": "10 - 30cm",
      "Growth": "medium",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 28°C",
      "Carbonate hardness": "2 - 12°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Proliferating leaves, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hygrophila-pinnatifida-UK",
    "name": "Hygrophila pinnatifida 'UK'",
    "url": "https://www.aquasabi.com/Hygrophila-pinnatifida-UK",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This variant of the beautiful Hygrophila pinnatifida from India entered the market under names such as \"Hygrophila pinnatifida sp. UK\". In this case the abbreviation does not mean United Kingdom but Uttara Kannada, a district of the Indian state Karnataka where the plant apparently was collected. It differs slightly from the customary H. pinnatifida form that was found in the border region of Goa and Maharashtra. The leaves of Hygrophila pinnatifida \"Uttara Kannada\" get slightly longer and tend a little more to red coloration. Furthermore they are more pronounced pinnately lobed.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Hygrophila-serpyllum",
    "name": "Hygrophila serpyllum",
    "url": "https://www.aquasabi.com/Hygrophila-serpyllum",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Hygrophila serpyllum is a small, creeping plant that is widespread in India. It colonises various wetlands that are periodically flooded and fall dry. This species is very different from other Hygrophilas in the aquarium hobby. Known to science for a long time, it has only become known as an aquarium plant in recent years. In the underwater form, the shoots grow creeping and branched, also hanging down from an elevated planting site, and root at the stem nodes. They form a mat at least 3 cm high, or a broad bush over 5 cm high if there is relatively little light. The approximately 1 to 1.5 cm long, roundish leaves are reminiscent of those of pennywort (Lysimachia nummularia), which however grows upright submerged. The stems are very thin but relatively tough.\nIn its emersed form, the plant also forms a small-leaved mat, but also upright flowering shoots with several small white-blue flowers. The specific epithet serpyllum, ‘wild thyme’, refers to the appearance of this Hygrophila, which forms low, richly flowering mats in the terrestrial form.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Juncus-repens",
    "name": "Juncus repens",
    "url": "https://www.aquasabi.com/Juncus-repens",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Creeping rush originates from swampy areas of the southeasern USA, Cuba and eastern Mexico. Its long shoots float in shallow water, and the emersed plant grows creeping on wet bottom, therefore its name. In its submerged form, it is a loosely upright growing stem plant with tufted side shoots and water roots. Its leaves get about 10 cm long and 3 mm wide. Without trimming, Juncus repens grows in the aquarium to the surface where it develops a dense mat, but the lower parts start to look unsightly. Its grass-like bushes look best when they do not exceed a height of about 20 - 30 cm. Under moderate light, it has a pleasant, freshly green colour, but it assumes a brown-red hue under intense lighting and good micronutrient supply.",
      "notes": "Even though other members of the rush family (Juncaceae) are popular plants for ponds or their edges, Juncus repens, the lesser creeping rush, is their only representative used in aquaria so far. Its habit is quite unique, as it looks like a mixture of stem and rosulate plant. Its flattish stem is interrupted by tufts of numerous narrow, pointed leaves in regular distances.This rush species is quite common the southeast of the US, where it is found growing emersed as well as submersed. Even though it is not frequently found in trade in its country of origin, it is readily available for European hobbyists.The overall requirements of J. repens are easy to meet, and the plant does well in a multitude of different setups, it grows equally well under low light as under strong light. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Creeping rush, Lesser creeping rush",
      "Complete botanical name": "Júncus répens Michx.",
      "Family": "Juncaceae",
      "Genus": "Juncus",
      "Difficulty": "easy",
      "Usage": "Background, Midground, Foreground, group",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 28°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Leptodictyum-riparium",
    "name": "Leptodictyum riparium",
    "url": "https://www.aquasabi.com/Leptodictyum-riparium",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Kneiff's feathermoss is an undemanding, fast-growing moss for cold- as well as warm-water tanks. This is true Leptodictyum riparium, it is not the same as the upright-growing so-called \"Stringy moss\". It is found in almost all the world, mainly in the temperate climate zone, and one of the most common water mosses in Germany. This species mostly occurs along flowing waters, above and below water, mostly on tree roots and rock. In its terrestrial form, it develops a flat mat, often with spore capsules. Its submerged shoots grow horizontally, or rather, in all directions, like those of Java moss. Their rhizoids cling to solid matter. The moss is often pearling with many silvery oxygen bubbles hanging between the leaflets.",
      "notes": "In aquaristics, the name Leptodictyum riparium (or Amblystegium riparium) is commonly used for the upright-growing \"stringy moss\". However, populations of L. riparium native to Germany have a very different appearance even when kept under the same conditions. They form - if they are not kept under very low light - more or less horizontal shoots with a dense, flat foliage. The growth habit of this moss corresponds to the descriptions of L. riparium in taxonomic literature (e.g. Frahm & Frey 1992) far better than that of the upright-growing \"stringy moss\". We are of the opinion that the popular \"stringy moss\" is Drepanocladus aduncus, not L. riparium.Streamside Leptodictyum moss, or Leptodictyum riparium, is distributed in almost all the world, and besides willow moss (Fontinalis antipyretica) it is probably the most common aquatic mmoss in Central Europe. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Streamside Leptodictyum moss",
      "Synonyms": "Hypnum riparium Hedw., Amblystegium riparium (Hedw.) Schimp.",
      "Complete botanical name": "Leptodíctyum ripárium (Hedw.) Warnst.",
      "Family": "Amblystegiaceae",
      "Genus": "Leptodictyum",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Plant for spawning, Nano tanks",
      "Growth": "medium",
      "pH value": "5 - 8",
      "Temperature tolerance": "4 - 26°C",
      "Carbonate hardness": "2 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lilaeopsis-brasiliensis",
    "name": "Lilaeopsis brasiliensis",
    "url": "https://www.aquasabi.com/Lilaeopsis-brasiliensis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Lilaeopsis brasiliensis can grow very densely, but it only grows like a lawn under very intensive light. When planting, make small tufts and put them into the ground with a distance of only a few centimetres, as the plants form an uninterrupted lawn more easily this way. The planted area should be without shade so the plants get sufficient light. Also suitable for a garden pond, and it tolerates the low salinity of a brackish water aquarium.",
      "notes": "folgt (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Misapplied names": "Lilaeopsis attenuata, Lilaeopsis novae-zelandiae, Neuseeland-Graspflanze, Neuseelandgras",
      "Complete botanical name": "Lilaeópsis brasiliénsis (Glaz.) Affolter",
      "Family": "Apiaceae",
      "Genus": "Lilaeopsis",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Height": "3 - 6cm",
      "Growth": "medium",
      "pH value": "6 - 7",
      "Temperature tolerance": "4 - 28°C",
      "Carbonate hardness": "2 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lilaeopsis-carolinensis",
    "name": "Lilaeopsis carolinensis",
    "url": "https://www.aquasabi.com/Lilaeopsis-carolinensis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Carolina grasswort is a turf-forming plant from North America and the southern part of South America. It is more rarely available than the Brazilian grasswort, L. brasiliensis, and differs from it i.a. by spathulate leaves with blunt tip. In its terrestrial form, Lilaeopsis carolinensis gets taller than L. brasiliensis, but it stays similarly short when it grows under water.",
      "notes": "follows (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Carolina grasswort",
      "Misapplied names": "Lilaeopsis attenuata",
      "Complete botanical name": "Lilaeópsis carolinénsis J.M.Coult. & Rose",
      "Family": "Apiaceae",
      "Genus": "Lilaeopsis",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Height": "4 - 20cm",
      "Growth": "slow",
      "pH value": "6 - 7",
      "Temperature tolerance": "4 - 28°C",
      "Carbonate hardness": "2 - 14°dKH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lilaeopsis-macloviana",
    "name": "Lilaeopsis macloviana",
    "url": "https://www.aquasabi.com/Lilaeopsis-macloviana",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This Lilaeopsis species from the southern part of South America is not well known in the aquarium hobby. It has up to 30 cm tall, nearly terete, hollow, culm-like leaves. Typical for the Lilaeopsis genus are the crosswise furrows on the leaves.",
      "notes": "folgt (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Lilaeópsis macloviána (Gand.) A.W. Hill",
      "Family": "Apiaceae",
      "Genus": "Lilaeopsis",
      "Difficulty": "medium",
      "Usage": "Background, Midground",
      "Height": "30 - 50cm",
      "Growth": "fast",
      "pH value": "6 - 7",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "2 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lilaeopsis-mauritiana",
    "name": "Lilaeopsis mauritiana",
    "url": "https://www.aquasabi.com/Lilaeopsis-mauritiana",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This Lilaeopsis is restricted to Mauritius in the Indian Ocean. It is likewise suitable as lawn-forming foreground plant as Lilaeopsis brasiliensis, however it has much narrower leaves with roundish cross section, so it has the appearance of a fine-leaved grass.",
      "notes": "Lilaeopsis mauritiana is an endemic plant of the island of Mauritius. This species was first collected for aquaristic purposes in 1992, and in 1995, the aquatic plant nursery Tropica introduced it to the market under the name Lilaeopsis sp. \"Mauritius\". Only later on (in 1999) it was described as the new species L. mauritiana. From those Lilaeopsis species in cultivation in the hobby up to now, L. mauritiana is the one with the narrowest leaves.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Lilaeopsis sp. ''Mauritius''",
      "Trader names": "Lilaeopsis mauritius",
      "Complete botanical name": "Lilaeópsis mauritiána G. Petersen & Affolter",
      "Family": "Apiaceae",
      "Genus": "Lilaeopsis",
      "Difficulty": "medium",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "slow",
      "pH value": "6 - 7",
      "Temperature tolerance": "20 - 30°C",
      "Carbonate hardness": "2 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Limnobium-laevigatum",
    "name": "Limnobium laevigatum",
    "url": "https://www.aquasabi.com/Limnobium-laevigatum",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "South-American frogbit is a popular floating plant for aquaria that is rather undemanding and grows fast. Its round smooth leaves are attractive in open tanks, the long roots bring a very natural, primeval feel to the aquarium. Limnobium laevigatum is especially suitable for fish and shrimp breeding tanks, as it removes surplus nutrients from the water very efficiently.",
      "notes": "Limnobium laevigatum, Amazon frogbit, is a floating plant that looks a bit like a very large duckweed. It is native to lakes, ponds and slow-flowing rivers in all of Central and South America.Compared with the North American frogbit species Limnobium spongia, which is only rarely cultivated in aquaria these days, it is much more adaptable especially regarding temperature. Common frogbit (Hydrocharis morsus-ranae), native to Europe and Western Asia, is hardy and thus a great pond plant. It hibernatives in the form of winter buds (turions), and, other than Limnobium laevigatum, it is possibly not apt to live in a tropical tank in the long run.The growth habit of the Amazon frogbit is comparable to other floating plants. The floating rosette forms runners regularly, at whose ends young plants grow. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Amazon frogbit, Smooth frogbit, South American spongeplant",
      "Synonyms": "Salvinia laevigata Humb. & Bonpl. ex Willd., Limnobium laevigatum (Humb. & Bonpl. ex Willd.) C. V. Morton, Trianea bogotensis H. Karst.",
      "Misapplied names": "Limnobium spongia",
      "Complete botanical name": "Limnóbium laevigátum (Humb. & Bonpl. ex Willd.) Heine",
      "Family": "Hydrocharitaceae",
      "Genus": "Limnobium",
      "Difficulty": "easy",
      "Usage": "Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "4 - 35°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Limnophila-sessiliflora",
    "name": "Limnophila sessiliflora",
    "url": "https://www.aquasabi.com/Limnophila-sessiliflora",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Limnophila sessiliflora from Tropical Asia is an undemanding, very fast-growing plant, long known in the aquarium hobby. This fine-leaved light green stem plant is a good alternative to the more demanding Cabomba species.",
      "notes": "Limnophila sessiliflora is a rather undemanding plant from South-East Asia, which is often sold as \"Asian marshweed\" or \"Ambulia\" in the USA. In its natural habitat, it is found on the edges of stagnant waters and the banks of rivers and rivulets. In the aquarium hobby, L. sessiliflora is the most common Limnophila species and is cultivated in many aquatic plant nurseries. It has been introduced into nature in several regions outside its natural area of distribution and is considered an aquatic weed that endangers natural biotopes e.g. in the USA. Limnophila sessiliflora is a robust, highly adaptable plant able to cope with a wide range of environmental conditions (pH 5.5-8, temperature 22-28°C). Its likeness to some Cabomba species makes it a coveted aquarium plant, as its light requirements are considerably lower. Given that there is sufficient light (0. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Limnóphila sessiliflóra (Vahl) Blume",
      "Family": "Plantaginaceae",
      "Genus": "Limnophila",
      "Difficulty": "easy",
      "Usage": "Background",
      "Aquascaping": "fine-leaved",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "15 - 28°C",
      "Carbonate hardness": "2 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lomariopsis-cf-lineata",
    "name": "Lomariopsis cf. lineata",
    "url": "https://www.aquasabi.com/Lomariopsis-cf-lineata",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The \"Suesswassertang\" (\"Freshwater seaweed\") is an exceptional aquarium plant that became known in Germany first, but likely originates from tropical Asia. It is neither a moss nor an algae but the prothallium (gametophyte) stage of a fern of the genus Lomariopsis. It can be used like Monosolenium tenerum, but it has several advantages over the latter: the thalli are far less brittle and will attach themselves to decorative material with their rhizoids. The freshly green cushions of Lomariopsis cf. lineata with their transparent, roundish branches are an eyecatcher in every aquarium.",
      "notes": "So-called \"Suesswassertang\", \"Loma fern\" or \"round pellia\" is neither a moss nor an algae, but the prothallium (gamethophyte) of a fern. Its carreer in the hobby began when it was discovered by Christel Kasselmann in one of her own aquaria in around 2001. She propagated it and gave parts of it to other aquarists (Kasselmann 2007). Soon this plant spread among hobbyists in all the world. Sellers on the Internet created the botanically entirely erroneous but highly popular name \"Suesswassertang\". It is unknown where the plant Christel Kasselmann found in her tank originally comes from; it is possible that it was introduced with plants from nature or from an aquatic plant nursery.In 2007, a team of researchers was able to partially clear up this plant's identity: 97% of the DNA sequences they examined were identical to those of the fern Lomariopsis lineata, which is found in... (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Lomariopsis prothallium, Suesswassertang, ''Subwassertang'', Loma fern, ''Round Pellia''",
      "Family": "Lomariopsidaceae",
      "Genus": "Lomariopsis",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks, Foreground, group",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ludwigia-inclinata-var-verticillata-Cuba",
    "name": "Ludwigia inclinata var. verticillata 'Cuba'",
    "url": "https://www.aquasabi.com/Ludwigia-inclinata-var-verticillata-Cuba",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A beautiful stem plant, which was found some time ago on the Cuban island Isla de Juventud. When cultivated submerged its shoots are densely covered by narrow leaves.",
      "notes": "Ludwigia inclinata var. verticillata 'Cuba' (formerly known as Ludwigia sp. 'Cuba') is a beautiful large stem plant, growing emersed as well as submersed in swampy areas on the \"Isle of Youth\", a small island off the south-western coast of Cuba. When cultivated above the waterline, its leaves are typical for an emersed Ludwigia, ovate and green, however, when cultivated submersed, its leaves grow out long, thin and show a marbled pattern with red and orange hues. Besides its unique appearance, this variety belongs to the species of Ludwigia inclinata, all of whose members form the same large yellow flower even though their geographical locations as well as their habit differ greatly. L. inclinata var. verticillata 'Cuba' was first introduced to the hobby by Tropica, not too long ago. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Cuban Ludwigia",
      "Complete botanical name": "Ludwígia inclináta (L. f.) Raven var. verticilláta Kasselmann",
      "Family": "Onagraceae",
      "Genus": "Ludwigia",
      "Difficulty": "medium",
      "Usage": "Accent (red), Background, Midground",
      "Aquascaping": "fine-leaved, very colourful plant for accents",
      "Growth": "fast",
      "pH value": "4 - 7",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 8°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ludwigia-inclinata-var-verticillata-Meta",
    "name": "Ludwigia inclinata var. verticillata 'Meta'",
    "url": "https://www.aquasabi.com/Ludwigia-inclinata-var-verticillata-Meta",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Meta\" is a still new, splendidly red coloured form of Ludwigia inclinata var. verticillata with only moderate requirements. It was brought from the Departamento del Meta in central Colombia a few years ago. In the moment it is still a rarity. In the submerged form, the plant develops narrow, about 5 cm long and 2 mm wide leaves in whorls, usually 11 per whorl. The shoots grow to at least 30 cm high and 8 cm wide and branch little. The stem grows to about 4 mm wide. The leaves develop strong red to orange tones in plenty of light.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ludwigia-inclinata-var-verticillata-White",
    "name": "Ludwigia inclinata var. verticillata 'White'",
    "url": "https://www.aquasabi.com/Ludwigia-inclinata-var-verticillata-White",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This plant is a variant of Ludwigia inclinata with white variegated submerged leaves growing very densely. It is a mutant of L. inclinata var. verticillata 'Cuba'.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ludwigia-palustris-Super-Red",
    "name": "Ludwigia palustris \"Super Red\"",
    "url": "https://www.aquasabi.com/Ludwigia-palustris-Super-Red",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A relatively small Ludwigia that assumes an intensively red colour even under medium light. It ramifies well and is rather undemanding. It was brought onto the market under several names, also as L. palustris. However, it differs from the customary L. palustris. Do not mix up with Ludwigia \"Rubin\" that develops larger leaves.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Ludwigia sp. 'Red', Ludwigia 'Mini Super Red', Ludwigia sp. 'Super Red'",
      "Complete botanical name": "Ludwígia palústris (L.) Elliott",
      "Family": "Onagraceae",
      "Genus": "Ludwigia",
      "Difficulty": "easy",
      "Colour": "red",
      "Usage": "Accent (red), Background, Midground, Nano tanks, Street (Dutch style)",
      "Aquascaping": "very colourful plant for accents",
      "Height": "20 - 50cm",
      "Width": "4 - 6cm",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 28°C",
      "Carbonate hardness": "0 - 14°dKH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ludwigia-repens-x-arcuata",
    "name": "Ludwigia repens x arcuata",
    "url": "https://www.aquasabi.com/Ludwigia-repens-x-arcuata",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This Ludwigia is a hybrid between the North American species L. repens and L. arcuata. It is long known and has proven as an undemanding, colourful stem plant. Its lanceolate leaves become blood-red under good light. The stems are densely set with leaves; the internodes are short.",
      "notes": "This plant is a natural hybrid of Ludwigia repens and L. arcuata and is frequently found in Florida. Its lanceolate leaves remind of Ludwigia brevipes.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Onagraceae",
      "Genus": "Ludwigia",
      "Difficulty": "easy",
      "Usage": "Accent (red), Background, Midground",
      "Aquascaping": "well-branched, bushy, very colourful plant for accents",
      "Growth": "fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "2 - 22°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Lysimachia-parvifolia",
    "name": "Lysimachia parvifolia",
    "url": "https://www.aquasabi.com/Lysimachia-parvifolia",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This unusual plant has only been known in the aquarium hobby for a few years as \"Samolus parviflorus 'Red'\" and has been available privately rather than in the regular trade. It was originally found growing submerged in a river in the limestone region of the Chinese province of Guangxi. The characteristics of the terrestrial form do not match Samolus, but clearly Lysimachia parvifolia, a loosestrife species native to south and south-east China. It occurs in wet places such as stream banks, ditches and rice paddies.\nThe plant grows more or less broadly rosette-like under water, about 10 - 20 cm wide, with several shoots. In low light, elongated shoots may also appear. In bright light, the leaves are red to dark red in colour, in weaker light with slightly orange tones. \nThe emersed form looks completely different. The plant then develops flowering shoots about 30 - 50 cm high and many long, runner-like, \"flagelliform\" side shoots. The emersed leaves are alternate, narrowly elliptical to spatulate, green to slightly reddish and, at around 1 - 4.5 cm long, much smaller than the submersed leaves, hence the name L. parvifolia, \"small-leaved\". The stem is more or less reddish. Small, white, almost bell-shaped flowers open on upright racemose inflorescences.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Marsilea-crenata",
    "name": "Marsilea crenata",
    "url": "https://www.aquasabi.com/Marsilea-crenata",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Dwarf waterclover, Marsilea crenata, is a pretty aquatic fern from tropical Asia and Australia that forms a small-leaved carpet in the aquarium. M. crenata is also sometimes regarded as a synonym of Marsilea minuta and is labelled as such by the company Tropica, for example. Like other Marsilea species, this fern grows in nature in various wetlands such as swamps, rice fields and floodplains. In the terrestrial form, long-stalked leaves with four leaflets grow on the creeping rhizomes, looking like \"lucky clover\". Marsilea crenata is usually sold in this emersed form. After some acclimatisation time, new shoots with much shorter submerged leaves grow in the aquarium, while the old emersed leaves slowly die off and can be cut off. The submerged leaves are usually undivided with small, rounded to spatulate leaf blades and are rarely more than 5 mm wide. They are significantly smaller than the submersed leaves of Marsilea hirsuta. Sometimes two-, three- or four-part leaves of different heights develop. Marsilea crenata spreads moderately quickly in the aquarium with its runners. The carpet grows to a height of about 1 - 3 cm.",
      "notes": "Marsilea crenata is a widely-spread water clover distributed in South-East Asia and Australia (Northern Territory, northern and central-eastern Queensland). It is found in shallow water and on drying-out mud, amongst others in rice paddies. M. crenata cannot be clearly discerned from Marsilea minuta, and might even belong to that species (Nagalingum & al. 2007).In trade, you often see the names M. crenata, M. hirsuta, M. exarata, M. drummondii and M. quadrifolia, however, it is not sure whether the respective plant was identified correctly. Most species of the genus Marsilea can only safely be identified in their emersed form by means of their sporocarps (spore-containing fruit).Please see  Marsilea spp.  (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Marsílea crenáta C. Presl",
      "Family": "Marsileaceae",
      "Genus": "Marsilea",
      "Usage": "Foreground, ground cover",
      "Aquascaping": "forms a small-leaved carpet",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Marsilea-hirsuta",
    "name": "Marsilea hirsuta",
    "url": "https://www.aquasabi.com/Marsilea-hirsuta",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Rough waterclover, Marsilea hirsuta, is a recommended, fairly undemanding ground cover in its underwater form. It is native to Australia and, like other waterclover species, is known there as \"Nardoo\". Like other Marsilea species, M. hirsuta is an amphibious fern in floodplains, swamps, banks, etc. in nature. Waterclover species form a carpet of long creeping, branched rhizomes. In the terrestrial form, \"lucky clover\" leaves with long petioles and four leaflets grow. Marsilea hirsuta is usually sold in this emersed form. \nAfter some acclimatisation time, new shoots with much shorter submerged leaves grow in the aquarium, while the old emersed leaves slowly die off and can be cut off. The submerged leaves are usually undivided and roundish, like large Glossostigma leaves. Occasionally, two-, three- or four-part leaves of different heights also appear. The carpet gets about 2 to 10 cm high. Marsilea hirsuta spreads relatively quickly in the aquarium with its runners.",
      "notes": "The water clover Marsilea hirsuta is widely spread in Australia. It is mostly found in marshes and floodplains. In trade, you often see the names M. crenata, M. hirsuta, M. exarata, M. drummondii and M. quadrifolia, however, it is not sure whether the respective plant was identified correctly. Most species of the genus Marsilea can only safely be identified in their emersed form by means of their sporocarps (spore-containing fruit).Please see  Marsilea spp.  (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Hansen's Nardoo",
      "Synonyms": "Marsilea azorica Launert & Paiva",
      "Complete botanical name": "Marsílea hirsúta R. Br.",
      "Family": "Marsileaceae",
      "Genus": "Marsilea",
      "Usage": "Foreground, ground cover",
      "Aquascaping": "forms a small-leaved carpet",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Micranthemum-tweediei-Montecarlo-3",
    "name": "Micranthemum tweediei (\"Montecarlo-3\")",
    "url": "https://www.aquasabi.com/Micranthemum-tweediei-Montecarlo-3",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A highly interesting and recommendable ground-covering plant that was a rarity few years ago but got very popular in the aquascaping. It was discovered for the aquarium hobby around 2010 by Japanese and also South American aquarists. It was called Micranthemum sp. \"Montecarlo-3\" or \"Monte Carlo\" after a locality in the Argentinian province Misiones, as well as \"New Large Pearl Grass\" and \"Bacopita\". The plant has been identified as Micranthemum tweediei in the meantime. This Micranthemum occurs in Argentina, Uruguay and South Brazil, in wet places such as streambanks.  It looks like a larger version of Hemianthus callitrichoides, growing flat on the ground, forming a compact mat, in the emersed and submerged form. Its roundish to elliptic leaves are a bit smaller and of a darker green than those of the similar Micranthemum umbrosum.",
      "notes": "(not yet translated into English) (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Tweedie's pearlweed, Montecarlo pearlweed, New Large Pearl Grass, Bacopita",
      "Synonyms": "Micranthemum sp. ''Montecarlo-3'', Micranthemum sp. ''Montecarlo'', Micranthemum sp. ''Monte Carlo''",
      "Misapplied names": "Elatine hydropiper, Bacopa sp. ''Parana-í Guazú'', Hemianthus sp. ''Parana-í Guazú''",
      "Complete botanical name": "Micránthemum tweediei Benth.",
      "Family": "Linderniaceae",
      "Genus": "Micranthemum",
      "Difficulty": "easy",
      "Colour": "light green, medium green",
      "Texture": "kleinblättrig",
      "Usage": "Foreground, ground cover",
      "Aquascaping": "forms a small-leaved carpet",
      "Height": "1 - 3cm",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Carbonate hardness": "2 - 12°dKH",
      "Propagation": "Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Microsorum-pteropus",
    "name": "Microsorum pteropus",
    "url": "https://www.aquasabi.com/Microsorum-pteropus",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Classic\" Java fern with its large wide leaves has long been known as undemanding aquarium plant with multiple uses that can be cultivated very well as an epiphyte on rocks and driftwood.",
      "notes": "Microsorum pteropus, or Java fern, grows in innumerable locations in tropical and subtropical regions of Asia. It is often found on rocks or wood in rivulets and waterfalls. Some populations grow submersed permanently, others occur as terrestrial plants on moist forest ground. Java fern is a very widely spread, popular plant in the aquarium hobby, and it is on sale in most aquarium shops. 50 years ago it was brought into trade under the erroneous name Leptochilus decurrens, amongst others, which is not a synonym for M. pteropus, but the name of another fern. M. pteropus is very variable. The various forms can differ so much in size and leaf form that one might even assume they belong to different species. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Polypodium pteropus Blume, Microsorum pteropus (Blume) Ching, Colysis pteropus (Blume) Bosman, Leptochilus pteropus (Blume) Fraser-Jenk.",
      "Misapplied names": "Leptochilus decurrens",
      "Complete botanical name": "Microsórum ptéropus (Blume) Copeland",
      "Family": "Polypodiaceae",
      "Genus": "Microsorum",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Background, Midground",
      "Growth": "slow",
      "pH value": "5 - 8",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating leaves, Proliferating roots, Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Microsorum-pteropus-Petit",
    "name": "Microsorum pteropus 'Petit'",
    "url": "https://www.aquasabi.com/Microsorum-pteropus-Petit",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Microsorum pteropus 'Petit' is a small selection of the Java fern. It is also sold under the label Microsorum \"Mini\". Like M. pteropus 'Narrow', it has narrow leaves with an overall height of 10-25 cm. Furthermore, the leaves of 'Petit' are more wavy than those of the form 'Narrow'.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Microsorum-pteropus-Prothallium",
    "name": "Microsorum pteropus 'Prothallium'",
    "url": "https://www.aquasabi.com/Microsorum-pteropus-Prothallium",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This curiosity became known in the last years as \"Loxogramme sp., Wave moss\". It resembles a liverwort and has turned out as a gametophyte (prothallium) of the Java Fern, Microsorum pteropus. It is also similar to the \"Suesswassertang\" or \"Round Pellia\" (prothallium of Lomariopsis) but has considerably smaller, softer, darker green thallus branches. With time, it forms dark green cushions. The underside and margins of the thallus branches are covered with dark brown, hair-like rhizoids.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Microsorum-pteropus-Trident",
    "name": "Microsorum pteropus 'Trident'",
    "url": "https://www.aquasabi.com/Microsorum-pteropus-Trident",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Microsorum pteropus \"Trident\" is an uncommon Java fern variant probably originating from Sarawak (Borneo). It has feathery lobed leaves with approx. 2-5 lobes on each side. The central and the lateral lobes are very narrow, much like those of \"Needle Leaf\".",
      "notes": "Microsorum pteropus \"Trident\" is an uncommon Java fern form that probably comes from Sarawak (Borneo). Its leaves have 2 to 5 frontal lobes on each side. The middle and lateral lobes are very narrow, much like in the Java fern variety \"Needle Leaf\".- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Microsorum pteropus 'Fingers'",
      "Complete botanical name": "Microsórum ptéropus (Blume) Copeland",
      "Family": "Polypodiaceae",
      "Genus": "Microsorum",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Midground",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Proliferating leaves, Proliferating roots, Rhizomteilung, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Monosolenium-tenerum",
    "name": "Monosolenium tenerum",
    "url": "https://www.aquasabi.com/Monosolenium-tenerum",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Monosolenium tenerum is a nice dark green liverwort from the Asian subtropics. It grows to impressive large cushions consisting of forking shoots. This liverwort was originally brought onto the market under the erroneous name Pellia endiviifolia, and it is often mixed up with Lomariopsis lienata, a fern prothallium.",
      "notes": "Monosolenium tenerum is a beautiful, dark green liverwort originating from warm-temperate to subtropic areas of northern India, Nepal, Eastern Asia and Hawaii. There it is found on moist, shaded ground rich in nitrogen. It is quite rare in nature but can be more frequently found in settlements. This plant debuted as an aquarium moss in 2002, when it got well-known in the hobby, at first under the (false) name of Pellia endiviifolia. In the following year it was identified as Monosolenium tenerum by bryologist Prof. S.R. Gradstein (Goettingen University). It is often confused with the so-called suesswassertang, a fern prothallium. For distinction, please see \"Lomariopsis cf. lineata, 'Suesswassertang'\".M. tenerum could be described as a significantly larger, darker version of Riccia fluitans. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Cyathodium tenerum Steph., Dumortieropsis liukiuensis Horikawa",
      "Misapplied names": "Pellia endiviifolia",
      "Complete botanical name": "Monosolénium ténerum Griffith",
      "Family": "Monosoleniaceae",
      "Genus": "Monosolenium",
      "Difficulty": "easy",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks, Foreground, group",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 26°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Pellia-endiviifolia",
    "name": "Pellia endiviifolia",
    "url": "https://www.aquasabi.com/Pellia-endiviifolia",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The name Pellia is familiar to many aquarists because the liverwort species Monosolenium tenerum was originally brought onto the market under the erroneous name Pellia endiviifolia. Also Riccardia species are known in the hobby as \"Mini Pellia\" or \"Coral Pellia\". However, our liverwort is the true Pellia endiviifolia, the Endive Pellia. We labeled it as Pellia sp. first but have identified it by comparison with securely determined P. endiviifolia. It appeared spontaneously among mosses in an aquascape that was created with plants and materials from the company ADA. Pellia endiviifolia is widespread in the northern hemisphere, mostly in moist to wet, calcareous and nutrient-rich places, e.g. springs, streambanks and waterfalls in limestone areas. Mostly it is found above water, sometimes also submerged.\nThe underwater form of Pellia endiviifolia resembles Monosolenium tenerum in size and structure but it is a little smaller, lighter green and more transparent. It differs from the \"Subwassertang\", Lomariopsis cf. lineata, by thicker, lighter, less rounded thalli and presence of a midrib. Favorable aquarium conditions provided, it forms broad, dense cushions of bifurcated thalli in relatively short time.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Persicaria-sp-Sao-Paulo",
    "name": "Persicaria sp. 'Sao Paulo'",
    "url": "https://www.aquasabi.com/Persicaria-sp-Sao-Paulo",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Like all Persicaria species, this plant has a relatively high requirement for macro and micronutrients, which it also absorbs from the substrate in the aquarium. The addition of CO2 is recommended. Rather strong lighting promotes the splendid colouring of this plant. It is best to plant stems individually in a group with some distance between them. Like other stem plants, Persicaria sp. \"Sao Paulo\" can be propagated by terminal and partial cuttings. Stems that have become very long tend to become bare (shed lower leaves) and form many water roots at the nodes. If they are cut back severely, the remaining stems often sprout poorly again. It is therefore best to replace shoots that have become too long with terminal cuttings.",
      "notes": "Persicaria (Polygonum) sp. 'Sao Paulo' is a phantastic new aquarium plant from Brazil. At the moment, the correct species name of this knotweed is still in the dark. When kept in the right conditions, this is probably the most intensively coloured plant species currently avaiable for aquaria. It is offered by the Japanese company Rayon Vert, and it is also available among hobbyists in the USA.Unfortunately, under the name Polygonum sp. 'Sao Paulo' there is also another plant in trade, namely the very similar P. sp. 'Kawagoeanum', and it is even questionable if true 'Sao Paulo' is available in Europe at the moment.Thus we will list some characteristics suitable for differentiating these rather similar knotweeds in the following.a) Persicaria (Polygonum) sp. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Polygonaceae",
      "Genus": "Persicaria",
      "Difficulty": "medium",
      "Colour": "magenta",
      "Usage": "Accent (red), Semi-emersed plant for open tanks, Background, Midground",
      "Aquascaping": "very colourful plant for accents",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Phyllanthus-fluitans",
    "name": "Phyllanthus fluitans",
    "url": "https://www.aquasabi.com/Phyllanthus-fluitans",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Phyllanthus fluitans is a floating plant that is widespread in the Neotropics. The plant is also known in the hobby as \"floating spurge\" because it was attributed to the family Euphorbiaceae over a long period (today: Phyllanthaceae). Its round floating leaves are water-repellent and may become deeply brown-red especially under strong lighting and limited nitrogen supply. Also the roots are often a red colour, therefore its name \"Red root floater\".",
      "notes": "This nice little floating plant originates from the American tropics and is traditionally counted among the spurge family (Euphorbiaceae). Recent research has shown, though, that the genus Phyllanthus better be placed in its own family, that of Phyllanthaceae.Phyllanthus fluitans looks pretty similar to a floating fern of the genus Salvinia, however, instead of two floating leaves it has just one on each node (alternate leaves).The thin submerges stem has tufts of red roots and round, water-repellent floating leaves with a heart-shaped base that hide the stem more or less completely. The leaves often possess a convex centre, whereas the leaf margin is even with the waterline. Under favourable conditions, tiny white flowers with six petals appear in the leaf axils. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Red root floater",
      "Complete botanical name": "Phyllánthus flúitans Benth. ex Müll.Arg.",
      "Family": "Phyllanthaceae",
      "Genus": "Phyllanthus",
      "Difficulty": "medium",
      "Usage": "Water surface",
      "Growth": "fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Pogostemon-helferi",
    "name": "Pogostemon helferi",
    "url": "https://www.aquasabi.com/Pogostemon-helferi",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Daonoi\" is an odd plant growing in fast-flowing rivers in northwest Thailand on limestone. It was long only known to science, but some years ago, some aquarists from Thailand discovered it for the hobby. It is characterised by compact growth, curly leaves and a nice light green hue.",
      "notes": "Also called \"daonoi\" or \"downoi\" (Thai for \"litte star\"), Pogostemon helferi has been known to science for over 120 years, however, it was only discovered for aquaristic purposes in 1996, by Nonn Panitvong and Arthit Prasartkul, who found it in the Thai province Kanchanaburi, on the border to Myanmar. Within only a short period, P. helferi has become a very popular aquarium plant for the fore- and middleground.These authors found the species on a fast-flowing river with limestone ground. The plants grow on and between rocks, submersed for most of the rainy season in summer, and often in a strong current. During autumn and winter, the populations of P. helferi fall dry and form upright shoots with striking flower spikes typical for the genus Pogostemon.This Pogostemon species is easy in cultivation, given that specific requirements are met: sufficient light (0. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Downoi",
      "Synonyms": "Anuragia helferi (Hook. f.) Raizada, Dysophylla helferi Hook. f., Eusteralis helferi (Hook. f.) Panigrahi",
      "Complete botanical name": "Pogostémon hélferi (Hook. f.) Press",
      "Family": "Lamiaceae",
      "Genus": "Pogostemon",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Midground, Nano tanks, Foreground, group",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "15 - 28°C",
      "Carbonate hardness": "2 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ranalisma-rostratum",
    "name": "Ranalisma rostratum",
    "url": "https://www.aquasabi.com/Ranalisma-rostratum",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Ranalisma rostratum is a small plant from the water-plantain (Alismataceae) family and is native to tropical Asia. Although this plant became known in aquaristics a long time ago, it has remained a rarity in the trade. The species name is also spelled Ranalisma rostrata. In old aquarium literature this species is found under the synonym Echinodorus ridleyi. The genus Ranalisma contains only two species, the second species is Ranalisma humile from Africa.\nThis plant is one of the most beautiful grass-like ground covers. One hardly suspects this when it comes into the trade in its terrestrial form, for it then has rounded, spoon-like leaves and small white flowers from which conspicuous hedgehog-like aggregate fruits develop. Under water, however, Ranalisma rostratum develops light green, narrow, grass-like leaves and forms a bright green, low, about 4 to 6 cm high lawn through runner chains, very similar to Helanthium tenellum 'parvulum'. The submerged leaves are usually about 5 - 8 cm long and 2 - 3 mm wide.",
      "notes": "Ranalisma rostratum is a small plant from the Asian tropics and subtropics. It is often sold under the grammatically incorrect name \"Ranalisma rostrata\". When kept emersed, the leaves of R. rostratum are roundish, with a stalk, and the short inflorescence often consists of a single flower, from which a rather large erinaceous aggregate fruit develops. It contains a large number of rostrate nutlets with flat sides. The submersed form has light green lineal leaves and closely resembles the light green variety of Helanthium tenellum (please see Helanthium tenellum \"parvulum\"). Just like the species of the genus Helanthium, R. rostratum forms long runners that are truly modified inflorescences (pseudo or inflorescence stolons).R. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Echinodorus ridleyi Steenis, Echinodorus rostratus (Stapf) Gagnepain (1929),  not (Nuttall) Engelmann ex A. Gray (1848)",
      "Complete botanical name": "Ranalísma rostrátum Stapf",
      "Family": "Alismataceae",
      "Genus": "Ranalisma",
      "Difficulty": "medium",
      "Usage": "Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "fast",
      "Temperature tolerance": "20 - 28°C",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Riccardia-sp-chamedryfolia",
    "name": "Riccardia sp. \"chamedryfolia\"",
    "url": "https://www.aquasabi.com/Riccardia-sp-chamedryfolia",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Riccardia species are delicate, dark to medium green liverworts, clinging to wood or rock with their rhizoids, where they form compact cushions or lawn-like populations. They are called \"Coral moss\" or \"Mini Pellia\" in the aquarium hobby due to their dense ramification.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Aneuraceae",
      "Genus": "Riccardia",
      "Difficulty": "easy",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 28°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Riccardia-sp-graeffei",
    "name": "Riccardia sp. \"graeffei\"",
    "url": "https://www.aquasabi.com/Riccardia-sp-graeffei",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This very decorative form of \"Coral moss\", also known as \"Mini Pellia\", is probably Riccardia graeffei. Its thallus branches are wider, shorter and softer than those of Riccardia sp. \"chamedryfolia\", with a deeper green shade. The branches are horizontal, delicately ramified and form dense cushions with a layered structure.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Riccia-fluitans",
    "name": "Riccia fluitans",
    "url": "https://www.aquasabi.com/Riccia-fluitans",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The crystalwort, Riccia fluitans, is known as a floating plant since the early days of the aquarium hobby. Especially Takashi Amano has inspired many aquarists to keep Riccia also submerged as a ground cover, tied with a line to stones. However certain types from the Riccia fluitans species group are more suitable for that than others. The form that is nowadays most commonly available does not easily float up to the surface and forms large cushions of long, thin thallus branches under water in a short time. Another form with similarly long but wider branches is sold by us as Riccia fluitans \"Broad\".",
      "notes": "Riccia fluitans aka crystalwort is a floating plant found in all the world. It was scientifically described and catalogised as early as 1753 by Linnaeus, however, Takashi Amano from Japan was the first to keep it submersed in his nature aquaria, using it as an epiphyte by tying it to wood and rocks with a thin fishing line. Thus, Riccia became one of the most favourite plants of plant aquaristis. Meanwhile it has found its way into most plant dealers' product catalogues. There are four different varieties (originating from Japan, Europe, Thailand and Singapore), however, only the variety from Japan is suitable for submersed cultivation.Riccia fluitans is easy to cultivate. Its wide distribution may be attributed to the fact that it tolerates a multitude of different environmental conditions, e.g. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Crystalwort, Floating liverwort",
      "Complete botanical name": "Ríccia flúitans L.",
      "Family": "Ricciaceae",
      "Genus": "Riccia",
      "Difficulty": "medium",
      "Usage": "Plant for spawning, Nano tanks, Water surface",
      "Aquascaping": "fine-leaved",
      "Growth": "fast",
      "pH value": "5 - 7",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Riccia-fluitans-Broad",
    "name": "Riccia fluitans \"Broad\"",
    "url": "https://www.aquasabi.com/Riccia-fluitans-Broad",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "From the crystalwort species group, there are various, unspecified types in the aquarium hobby. They are usually called Riccia fluitans without any further distinction. Their appearance also depends strongly on the culture conditions, but they do differ under the same growth conditions. A finer and a coarser form are frequently found on the market. We call the coarser form provisionally Riccia fluitans \"Broad\". As well as the finer form, it has relatively long thallus branches, which, however, clearly differ in width. Between two bifurcations, the branches are about 8-9 mm long and 1,2 mm broad.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Ricciocarpos-natans",
    "name": "Ricciocarpos natans",
    "url": "https://www.aquasabi.com/Ricciocarpos-natans",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Floating Crystalwort is an unusual and rare, small floating plant, closely related to the Riccia genus. It has an almost worldwide distribution, from the tropics to cool northern regions, but is not really frequent in the nature. It grows floating as well as terrestrial on moist bottom. Ricciocarpos natans is rarely kept in aquaria and hardly available in the trade. The floating thalli are heart-shaped to half-round, fan-shaped, with dark, long scales on the underside resembling roots. Ricciocarpos propagates by bifurcation and falling apart of the branches. Terrestrial thalli are rosette-like and considerably broader than the floating ones.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Riccia natans L., Ricciocarpus natans",
      "Complete botanical name": "Ricciocárpos nátans (L.) Corda",
      "Family": "Ricciaceae",
      "Genus": "Ricciocarpos",
      "Difficulty": "easy",
      "Usage": "Water surface",
      "Growth": "fast",
      "Propagation": "Fragmentation",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-indica",
    "name": "Rotala indica",
    "url": "https://www.aquasabi.com/Rotala-indica",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "True Rotala indica is not very well-known as aquarium plant. At the moment is it labeled as Ammania sp. \"Bonsai\" and Rotala sp. \"Bonsai\" as the trade names, but its flowers have helped identify it correctly as R. indica. The name Rotala indica has been known in the aquarium hobby for a long time, but it was erroneously used for the totally different species Rotala rotundifolia. The unique appearance of Rotala indica can best be described as compact miniature version of Bacopa caroliniana. R. indica is a slow grower; under a lot of light, the shoot tips and stems turn reddish. With its straight hardly ramified thick stems and its roundish leaves it is best planted in a group in the fore- or middle ground of a tank. Rotala indica is especially suitable for smaller aquaria, but a large group of this plant may look nice in a bigger tank, too. Good lighting (at least 0.5 W/litre) and an ample supply of CO2 and nutrients need to be made sure. Moreover, R. indica should not be planted in the shade.",
      "notes": "There is quite a bit of confusion around the name Rotala indica in aquaristics. The reason for this is, that in 1960, Rotala rotundifolia was imported under the erroneous name \"Rotala indica\". Even today, especially reddish forms of the very variable R. rotundifolia are sold as \"Rotala indica\" in trade. True R. indica, however, is a competely different species that does not play a very important role as aquarium plant. Only recently, the plant sold as \"Ammannia sp. 'Bonsai' \" has been identified as true Rotala indica. It was also confused with Lindernia sp. \"India\". Rotala indica is widely spread in the warmer regions of Asia and is very often found as annual weed in rice paddies. It has been introduced into other regions of the earth where rice is cultivated, e.g. in Northern Italy.The emersed as well as the submersed forms of R. indica differ distinctly from R. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Indian toothcup",
      "Synonyms": "Ameletia indica (Willd.) DC.",
      "Misapplied names": "Ammania sp. ''Bonsai'', Ammannia sp. ''Bonsai''",
      "Trader names": "Ammania bonsai",
      "Complete botanical name": "Rotála índica (Willd.) Koehne",
      "Family": "Lythraceae",
      "Genus": "Rotala",
      "Difficulty": "medium",
      "Usage": "Midground, Nano tanks, Street (Dutch style), Foreground, group",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-ramosior-Florida",
    "name": "Rotala ramosior \"Florida\"",
    "url": "https://www.aquasabi.com/Rotala-ramosior-Florida",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Rotala ramosior is an annual plant native to wetlands from North to South America, which is also naturalised in Asia. It forms straight, slightly branched stems at least 20 cm long under water. There are various forms of this species in the aquarium hobby. Rotala ramosior \"Florida\" has small, cross-opposite, elongated, egg-shaped leaves that are strikingly red-violet in colour under suitable conditions. The leaf midrib, leaf base and stem are a contrasting light green colour. The shoots are about 2.5 cm wide and appear less compact than those of Rotala ramosior \"Sunset\". The leaves are about 1 to 1.3 cm long and 4 mm wide. The stem is 1.5 mm wide and the stem nodes are 5 to 8 mm apart.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-ramosior-Sunset",
    "name": "Rotala ramosior \"Sunset\"",
    "url": "https://www.aquasabi.com/Rotala-ramosior-Sunset",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This unique, rarely cultivated Rotala has also become known as \"Ammania sp. from Sulawesi\". It apparently belongs to Rotala ramosior, an annual species from wetlands from North to South America, which is also naturalised in Asia. Under water, Rotala ramosior \"Sunset\" forms straight, upright, sparsely branched stems. The elongated, cross-opposite leaves are strikingly brown-red with slightly red-violet tones under favourable conditions. The midrib and leaf base are a contrasting light green colour, and the stems are also green. The shoots are about 4 - 5 cm wide, the leaves 2.5 - 3 cm long and 4.5 mm wide. The stem is about 2 mm wide and densely covered with leaves. The stem nodes are 4 - 5 mm apart.\nIn addition to \"Sunset\", there are other R. ramosior forms such as \"Florida\" and a larger, green form from Virginia. \"Florida\" differs from \"Sunset\" in its strong red-violet tones, smaller, elliptical leaves and thinner stems; the plant also grows somewhat more slowly. In Rotala ramosior \"Sunset\", the more elongated leaves are more upright at the tip and more bent over further down the stem.",
      "notes": "- follows - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Rotala sp.",
      "Complete botanical name": "Rotála ramósior (L.) Koehne",
      "Family": "Lythraceae",
      "Genus": "Rotala",
      "Difficulty": "difficult",
      "Usage": "Accent (red), Midground, Nano tanks, Foreground, group",
      "Aquascaping": "very colourful plant for accents",
      "Growth": "slow",
      "pH value": "4 - 7",
      "Temperature tolerance": "18 - 30°C",
      "Carbonate hardness": "0 - 7°dKH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-rotundifolia-Green",
    "name": "Rotala rotundifolia \"Green\"",
    "url": "https://www.aquasabi.com/Rotala-rotundifolia-Green",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Rotala rotundifolia \"Green\" is also known as Rotala sp. \"Green\". In contrast to \"standard\" R. rotundifolia, the \"Green\" variant never turns reddish but keeps its fresh green colour even under very strong light. The plant has an attractive bushy elegantly overhanging growth habit. An occasional thorough trimming is recommendable, as this plant is a very fast grower. Amano masterfully uses the characteristic overhanging growth habit of this Rotala in many of his aquascapes.",
      "notes": "This plant that entered the aquarium plant trade as Rotala sp. \"Green\" is apparently a form of the very variable species Rotala rotundifolia. The characteristics of the submersed form of R. rotundifolia \"Green\" are:- purely green colour of leaves as well as stems,- a weeping habit (at first, the shoots grow upright, but then bow down), and- always only 2 (not 3 or more) leaves per node.Sometimes, other green forms of Rotala rotundifolia are sold under that name in trade, however, their submersed stems still show at least a reddish hue and grow strictly upright, other than those of true \"Green\". One can choose these plants if the overhanging habit of true R. rotundifolia \"Green\" does not complement the layout. However, this typical growth habit can be an interesting design feature.To be continued... (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Rotala sp. 'Green'",
      "Complete botanical name": "Rotála rotundifólia (Buch.-Ham. ex Roxb.) Koehne",
      "Family": "Lythraceae",
      "Genus": "Rotala",
      "Difficulty": "medium",
      "Usage": "Background, Midground",
      "Aquascaping": "well-branched, bushy",
      "Height": "20 - 80cm",
      "Width": "2 - 4cm",
      "Growth": "fast",
      "pH value": "4 - 7",
      "Temperature tolerance": "4 - 32°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Cuttings",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-rotundifolia-Orange-Juice",
    "name": "Rotala rotundifolia 'Orange Juice'",
    "url": "https://www.aquasabi.com/Rotala-rotundifolia-Orange-Juice",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Rotala rotundifolia 'Orange Juice' is a selection from Massimo Iannella a passionate plant enthusiast from Italy. The Orange Juice Rotala is like Rotala rotundifolia a time-tested popular stem plant wonderfully suitable for aquascaping. Its emerged form has roundish leaves, in the aquarium they grow to a longer, narrow form. Compared with other Rotala species it is relatively undemanding. This highly variable species is widely distributed in the Asian subtropics and tropics; standard variants available in trade are light green to reddish under water, depending on the light intensity. The leaves of the Orange Juice Rotala have stunning orange in the emerged and submerged form.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-rotundifolia-Pink",
    "name": "Rotala rotundifolia 'Pink'",
    "url": "https://www.aquasabi.com/Rotala-rotundifolia-Pink",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Rotala rotundifolia 'Pink' is also called R. rotundifolia \"Rosa\". Contrary to what the name suggests, the plant is predominantly a light, fresh shade of green. The undersides of the leaves are light pink in bright light. The shoots grow upright to ascending, unlike the often horizontally growing Rotala rotundifolia 'Green'. The underwater leaves are somewhat broader than those of 'Green'.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-rotundifolia-Shimoga",
    "name": "Rotala rotundifolia 'Shimoga'",
    "url": "https://www.aquasabi.com/Rotala-rotundifolia-Shimoga",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This decorative stem plant was introduced as Rotala sp. \"Shimoga\", apparently referring to the district Shimoga in the Indian state Karnataka. It is a qite large, broad leaved form of Rotala rotundifolia. Its luminous green submerged leaves are relatively broad and have an interesting shape, they are bent upwards and twisted to the side, showing the light pink undersides. Under intense lighting, also the upper sides at the shoot tips may show pinkish tones. The shoots grow upright, not horizontal or arching like certain other Rotala rotundifolia forms.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-rotundifolia-Singapore-Blood-Red",
    "name": "Rotala rotundifolia \"Singapore Blood Red\"",
    "url": "https://www.aquasabi.com/Rotala-rotundifolia-Singapore-Blood-Red",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "'Singapore Blood Red', also \"Blood Red Singapore\", certainly has the most intense red colouring of all Rotala rotundifolia forms. Under the same conditions, this Rotala has a darker red shade than R. rotundifolia 'Colorata'. As with \"normal\" Rotala rotundifolia, the shoots grow mostly upright to ascending, in very strong light also more or less horizontally. As with \"normal\" Rotala rotundifolia, the shoots grow to over 50 cm long, but look better if they are kept about 20 - 40 cm high by cutting and replanting cuttings. They branch quite well, the bushy growth is promoted by occasional pruning.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Rotala-wallichii-Bangladesh",
    "name": "Rotala wallichii \"Bangladesh\"",
    "url": "https://www.aquasabi.com/Rotala-wallichii-Bangladesh",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This magnificent, fast-growing stem plant was originally introduced as Rotala sp. \"Bangladesh\" and then long thought to be a form of Rotala mexicana. However, it turned out that it belongs to Rotala wallichii. That is why we no longer call it R. mexicana \"Bangladesh\", but R. wallichii \"Bangladesh\". The 4 - 5 cm wide shoots grow upright and branch moderately. The stem is about 1.5 to 1.8 mm thick and has whorls of about 9 - 11 linear leaves at the stem nodes. The stem nodes are about 6 to 9 mm apart. The leaves, which are about 3 cm long and 1 mm wide, are somewhat broader than the thread-thin leaves of \"normal\" Rotala wallichii and are lighter in colour. The colouring ranges from light green to light red and is very changeable depending on light intensity and nutrient supply, so the shoots within a stand may differ slightly in colour from one another. This plant also has lower cultivation requirements. Although this Rotala has been known in Europe for over ten years, it is relatively rare in the trade.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Sagittaria-subulata-Pusilla",
    "name": "Sagittaria subulata \"Pusilla\"",
    "url": "https://www.aquasabi.com/Sagittaria-subulata-Pusilla",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Dwarf arrowhead stays lower than the \"standard\" form of Sagittaria subulata when it is grown under the same conditions. With lavish nutrient and CO2 supply, it reached a height of about 15 cm in our aquariums, otherwise it should remain lower in most cases. It is very well suited as a grass-like, undemanding ground cover, also in \"low tech\" tanks without additional CO2.",
      "notes": "Under the names \"Sagittaria pusilla\" or \"Sagittaria subulata var. pusilla\" an arrowhead is sold that is said to develop a lower growth habit than the \"normal\" form of Sagittaria subulata when it is grown in the same conditions. The overall height of S. subulata forms depends very much on the conditions they are cultivated in (please see the entry for Sagittaria subulata). There is indeed a Sagittaria form which stays reliably low under the same conditions, but this plant is rarely cultivated. However, at least in part the \"Sagittaria pusilla\" plants may get 30 cm or more.",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Dwarf arrowhead",
      "Complete botanical name": "Sagittária subuláta (L.) Buchenau",
      "Family": "Alismataceae",
      "Genus": "Sagittaria",
      "Difficulty": "easy",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Growth": "medium",
      "pH value": "5 - 9",
      "Temperature tolerance": "4 - 30°C",
      "Carbonate hardness": "2 - 30°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Salvinia-cucullata",
    "name": "Salvinia cucullata",
    "url": "https://www.aquasabi.com/Salvinia-cucullata",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The \"Asian watermoss\" is a particularly attractive floating fern species from tropical Asia where it occurs in sunny, still waters. Salvinia cucullata is hardly available in trade and also not very well known among aquarium hobbyists.\nOptimal growth conditions provided - plenty of light, rather high temperatures and nutrient-rich water - this Salvinia develops an interesting look with hood-like, rolled up leaves. It is scientifically named after that structure (from latin cucullus, cone or hood). With its side branches, the plant develops a dense floating mat with a comb-like look.\nHowever it also thrives under suboptimal conditions, with about one centimeter long, flat leaves, resembling Salvinia minima. The upper side of the leaves is densely set with hairs, giving the plant a velvety look. It has a pale, somewhat blueish green tone.",
      "notes": "follows (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Salvínia cuculláta Roxb.",
      "Family": "Salviniaceae",
      "Genus": "Salvinia",
      "Difficulty": "easy",
      "Usage": "Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 32°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Splitting, cutting off daughter plants",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Salvinia-minima",
    "name": "Salvinia minima",
    "url": "https://www.aquasabi.com/Salvinia-minima",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Common Salvinia is native to tropical America and develops only 1 to 1.5 cm long, roundish floating leaves. It stays considerably smaller than Salvinia auriculata.",
      "notes": "Salvinia minima is a small floating fern originating from the American tropics. It has been introduced into the south of the US, where it is considered an invasive aquatic weed. This floating fern, like other Salvinia species, forms floating mats on the surface of different, mostly stagnant waters.The floating leaves of S. minima are roundish to broad-oval, have a heart-shaped basis and grow to a length of 1 to 1.5 cm. Under unfavourable conditions they tend to stay smaller, however. The stems branch out and grow to a length of around 10 cm before they break, forming new plants.The hairs on the leaf surface most frequently form groups of four, and their tips are not connected (magnifying glass). This is an easy way to discern Salvinia minima from S. molesta and other species of the group of plants related to Salvinia auriculata. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Common Salvinia, Water spangles",
      "Misapplied names": "Salvinia natans, Salvinia rotundifolia",
      "Complete botanical name": "Salvínia mínima Baker",
      "Family": "Salviniaceae",
      "Genus": "Salvinia",
      "Difficulty": "easy",
      "Usage": "Water surface",
      "Growth": "very fast",
      "pH value": "5 - 8",
      "Temperature tolerance": "18 - 32°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Fragmentation, Splitting, cutting off daughter plants",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Schismatoglottis-prietoi",
    "name": "Schismatoglottis prietoi",
    "url": "https://www.aquasabi.com/Schismatoglottis-prietoi",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Schismatoglottis prietoi is a small aroid that is perfectly suitable as aquarium plant. This Schismatoglottis is a quite new species for science as well as for the aquarium hobby. It is native to the Philippines and was first found on Cebu Island. It was scientifically described and named in honour of its discoverer, Esquerion Prieto, in 2015. It grows largely submerged in nature and develops large stands in sandy to gravelly riverbeds by its runners, comparable to Cryptocoryne species. Its small, elliptic, glossy leaves resemble those of Anubias 'Petite' but are lighter green, the plant also grows faster than this Anubias.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Solenostoma-tetragonum-Gunung-Sumpit",
    "name": "Solenostoma tetragonum \"Gunung Sumpit\"",
    "url": "https://www.aquasabi.com/Solenostoma-tetragonum-Gunung-Sumpit",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A foliose liverwort found in the same place as Bucephalandra motleyana \"Gunung Sumpit\" on the island of Borneo. We think it may belong to the species Solenostoma tetragonum (synonym: Jungermannia tetragona), a liverwort largely distributed in the Asian tropics that is found in moist places.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Jungermannia tetragona Lindenb., Plectocolea tetragona (Lindenb.) Meijer",
      "Misapplied names": "Blepharostoma trichophyllum",
      "Complete botanical name": "Solenostoma tetragonum (Lindenb.) R.M. Schust. ex Vá?a & D.G. Long",
      "Family": "Solenostomataceae",
      "Genus": "Solenostoma",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "very slow",
      "pH value": "4 - 7",
      "Temperature tolerance": "18 - 28°C",
      "Carbonate hardness": "0 - 7°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Spirodela-polyrhiza",
    "name": "Spirodela polyrhiza",
    "url": "https://www.aquasabi.com/Spirodela-polyrhiza",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Greater duckweed stands out among the duckweeds due to its size and round shape. It is reminiscent of very small frogbit. Spirodela polyrhiza (also spelt S. polyrrhiza) is a true cosmopolitan; it occurs on all continents except Antarctica, from the temperate to the tropical climate zone. This floating plant grows in stagnant to slow-flowing, nutrient-rich, often somewhat shaded waters. Together with other duckweed species, it often forms a closed cover. The round fronds are about 0.5 to 1 cm in size. The upper side is light to medium green, with a reddish tinge in bright light. The underside is reddish to dark red and has a tuft of about 7 - 21 roots. New fronds sprout from \"pouches\" on the sides, which sooner or later detach. Under unfavourable conditions such as a lack of nutrients or frosty temperatures, the giant duckweed forms 2 - 3 mm wide, kidney-shaped, olive-coloured turions that sink to the bottom. These perennating buds sprout as soon as favourable growth conditions prevail again.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Staurogyne-repens",
    "name": "Staurogyne repens",
    "url": "https://www.aquasabi.com/Staurogyne-repens",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Staurogyne repens is a light green compact strong plant for the aquarium foreground originating from Rio Cristalino in Brazil. It can be used as ground-covering plant or as low cushion-like bush. Forms well through trimming. It is effective for setting accents in crevices and gaps in the hardscape. If you get a plant with long stems from emerged cultivation you ought to cut them off, cut them into several parts and plant them into the substrate, keeping a small distance. The lateral shoots that form in this case will grow more or less horizontally along the substrate. A lot of light (at least 0.5 W/litre) and a good CO2 and nutrient supply are recommendable.",
      "notes": "This plant was hitherto known as Staurogyne spec., or Staurogyne sp. \"Rio Cristalino\". However, in 2010, Dr. Dieter C. Wasshausen (Smithsonian Institution, Washington) identified flowering plants herbarised by Christel Kasselmann as Staurogyne repens (Nees) Kuntze [1]. The aquarium population of this species originates from Rio Cristalino in the Brazilian federal state Mato Grosso. The plant were found growing on and between rocks on the bank of the fast-flowing river, mainly above the waterline, and in full sun. [1],[2]. In May 2008, Staurogyne repens was presented as new aquarium plant (back then as Staurogyne spec.) during the Interzoo trade fair by Tropica. Recently, this plant has also been offered erroneously as Staurogyne sp. 'Porto Velho'. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Ebermaiera repens Nees",
      "Complete botanical name": "Staurogyne répens (Nees) Kuntze",
      "Family": "Acanthaceae",
      "Genus": "Staurogyne",
      "Difficulty": "easy",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "well-branched, bushy",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "20 - 30°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Staurogyne-sp-Porto-Velho",
    "name": "Staurogyne sp. \"Porto Velho\"",
    "url": "https://www.aquasabi.com/Staurogyne-sp-Porto-Velho",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Staurogyne sp. \"Porto Velho\" has only been known in the hobby in Europe for a few years, and it is still quite rare. This plant from South America grows moderately, develops a creeping growth habit under water and forms narrow lanceolate leaves with a long pointed tip. Its submerged form is greyish-green with a slight purple hue. This attractive carpet-forming plant needs good lighting and a good CO2 and nutrient supply.",
      "notes": "In Contrast to Staurogyne repens (see that plant's profile), Staurogyne sp. 'Porto Velho' is only rarely cultivated in Europe at the moment. In the USA and Japan, however, it is one of the most popular new foreground plants. It is a very attractive, versatile plant and will very probably remain popular for many years to come. Quite obviously, Staurogyne sp. 'Porto Velho' is identical with the aquarium plant sold as Hygrophila sp. 'Roraima', which probably originates from another import. The Brazilian federal states Rondonia (with the capital Porto Velho) and Roraima both are situated in the western part of the country. Thus it is highly probable that these plants, originally collected there, belong to the same species that is distributed in both these states. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Misapplied names": "Hygrophila sp. 'Porto Velho', Hygrophila sp. 'Roraima'",
      "Family": "Acanthaceae",
      "Genus": "Staurogyne",
      "Difficulty": "medium",
      "Usage": "Midground, Nano tanks, Foreground, group, Foreground, ground cover",
      "Growth": "medium",
      "pH value": "5 - 7",
      "Temperature tolerance": "20 - 30°C",
      "Carbonate hardness": "0 - 10°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Cuttings, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Taxiphyllum-alternans-Taiwan-Moss",
    "name": "Taxiphyllum alternans \"Taiwan Moss\"",
    "url": "https://www.aquasabi.com/Taxiphyllum-alternans-Taiwan-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The Taiwan moss resembles Taxiphyllum barbieri. It is as undemanding, but under good lights it grows much denser and more regular shoots whose outline is triangular, just like \"Christmas moss\". It may be used in a similar way but looks more delicate. You will receive this plant from in vitro cultivation.",
      "notes": "Taxiphyllum alternans (Cardot) Z. Iwatsuki is a moss with a creeping habit originating from regions with temperate to subtropical climates: the south-east of the USA and Eastern Asia. In the habitat, it lives on earth and exposed tree roots, on rotting wood in swamps and on rocks on rivulets and waterfalls. At first it was introduced to the hobby as Taiwan moss, even though it is not clear yet if this moss is native to Taiwan at all. Later on, Prof. Benito C. Tan (Singapore) identified it as Taxiphyllum alternans.Taiwan moss is very similar to Taxiphyllum barbieri, however, under good lighting it branches more densely and regularly. The two species can be discerned under a microscope, too: the leaf margin of T. alternans is only sawed around the leaf tip, whereas the entire margin of T. barbieri is finely sawed. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Taxiphýllum altérnans (Cardot) Z. Iwats.",
      "Family": "Hypnaceae",
      "Genus": "Taxiphyllum",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 8",
      "Temperature tolerance": "12 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Taxiphyllum-barbieri-Java-moss",
    "name": "Taxiphyllum barbieri \"Java moss\"",
    "url": "https://www.aquasabi.com/Taxiphyllum-barbieri-Java-moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Taxiphyllum barbieri is the most popular aquarium moss there is. It was confused with Vesicularia dubyana for a long time, therefore it is mostly called \"Java moss\"; another name is \"Bogor moss\". In the nature, it is only recorded from Vietnam so far. This tropical water moss forms long, irregularly branched, about 1,5 mm wide shoots that attach willingly to all kinds of surfaces, which makes it an ideal moss for accentuating the hardscape or for hiding technical equipment in the tank. With stronger lighting, it branches more, while its shoots get thin, thread-like and poorly ramified under low light. It grows fast for a moss; we have determined a growth rate of up to 3 - 4 cm per month.",
      "notes": "Taxiphyllum barbieri is most commonly called Java moss, and it is the most popular and the most wide-spread aquarium moss there is. Often it is mistaken for Vesicularia dubyana, however, as early as 1982, the moss expert Zennosuke Iwatsuki identified \"Java moss\" he got from aquarists as Taxiphyllum barbieri. Some years ago, his results were published to a large audience (Benito C. Tan & al. 2004); in this publication, T. barbieri is called Java moss and the real Vesicularia dubyana is given the name Singapore moss.Unfortunately, the authors were unaware that the original \"Java moss\" cultivated in Europe over 50 years ago was indeed Vesicularia dubyana and that it was more or less completely supplanted by the faster-growing Taxiphyllum barbieri, which was introduced to the hobby later.G. Benl introduced T. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Java moss",
      "Synonyms": "Isopterygium barbieri Cardot & Copp.",
      "Misapplied names": "Glossadelphus zollingeri, Vesicularia dubyana",
      "Complete botanical name": "Taxiphýllum barbíeri (Cardot & Copp.) Z. Iwats.",
      "Family": "Hypnaceae",
      "Genus": "Taxiphyllum",
      "Difficulty": "very easy",
      "Usage": "Epiphyte (growing on hardscape), Plant for spawning, Nano tanks",
      "Growth": "medium",
      "pH value": "5 - 8",
      "Temperature tolerance": "12 - 34°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Taxiphyllum-sp-Flame-Moss",
    "name": "Taxiphyllum sp. \"Flame Moss\"",
    "url": "https://www.aquasabi.com/Taxiphyllum-sp-Flame-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Flame moss\" has not been fully identified yet, but belongs to the genus Taxiphyllum. It probably comes from East or South-East Asia. Even though it has only been known for a few years, it is relatively popular as aquarium moss, and frequently found in trade. Its popularity as well as its trivial name derive from the characteristic uncommon growth habit that makes this moss unique: under water the shoots do not ramify readily, and they grow upright and spiralling so they look a little like flames.",
      "notes": "\"Flame moss\" is a not yet fully identified species of the genus Taxiphyllum and probably comes from East or South-East Asia. Even though it has only been known for a few years it already has a great popularity in the hobby and is readily available in trade. This popularity (as well as its name) is due to the fact that it has quite an uncommon growth habit that makes it unmistakable: under water, its sparsely ramifying shoots grow in upright spirals, which reminds of flames.The impression of green darting flames is even enhanced if the moss is attached along entire branches or thin pieces of driftwood.To be continued... (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Hypnaceae",
      "Genus": "Taxiphyllum",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 8",
      "Temperature tolerance": "12 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Taxiphyllum-sp-Spiky-Moss",
    "name": "Taxiphyllum sp. \"Spiky Moss\"",
    "url": "https://www.aquasabi.com/Taxiphyllum-sp-Spiky-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "\"Spiky moss\" is a strong Taxiphyllum species that is not yet determined to species. Under good lighting it forms densely ramified deep green shoots resembling fir branches. It is a relatively fast grower for a moss.",
      "notes": "The hitherto unidentified Taxiphyllum species that is called \"spiky moss\" in Singapore is in our opinion identical with \"peacock moss\".",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Common names": "Spiky moss, Peacock moss",
      "Synonyms": "Taxiphyllum sp. ''Peacock moss''",
      "Family": "Hypnaceae",
      "Genus": "Taxiphyllum",
      "Difficulty": "easy",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "medium",
      "pH value": "5 - 8",
      "Temperature tolerance": "12 - 34°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "easy"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Utricularia-graminifolia",
    "name": "Utricularia graminifolia",
    "url": "https://www.aquasabi.com/Utricularia-graminifolia",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Utricularia graminifolia is a grass-like bladderwort species from the Asian tropics that grows into a lush bright light green lawn. It is thus quite popular in aquascaping, too. It is not always easy to cultivate, but under favourable conditions (lots of light, soft water, CO2, macro- and micronutrient fertilisation) it is a fast grower.",
      "notes": "follows (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Utriculária graminifólia Vahl",
      "Family": "Lentibulariaceae",
      "Genus": "Utricularia",
      "Difficulty": "difficult",
      "Usage": "Nano tanks, Foreground, group, Foreground, ground cover",
      "Aquascaping": "forms a grass-like lawn",
      "Growth": "medium",
      "pH value": "4 - 7",
      "Temperature tolerance": "16 - 28°C",
      "Carbonate hardness": "0 - 12°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners, Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vallisneria-nana-Tiger",
    "name": "Vallisneria nana \"Tiger\"",
    "url": "https://www.aquasabi.com/Vallisneria-nana-Tiger",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This plant is mostly labeled Vallisneria spiralis 'Tiger', 'Striped', 'Marmor' (Marble) or 'Leopard'. However, a DNA analysis  (Les & al., 2008) has revealed that the Tiger Vallisneria is a variant of Vallisneria nana. This Australian species is quite variable and includes not only the well-known very narrow-leaved, but also quite large plants with similarly broad leaves as Vallisneria spiralis.",
      "notes": "follows (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Synonyms": "Vallisneria ''Striped''",
      "Misapplied names": "Vallisneria spiralis ''Tiger'', Vallisneria spiralis ''Striped''",
      "Complete botanical name": "Vallisnéria nána R. Br.",
      "Family": "Hydrocharitaceae",
      "Genus": "Vallisneria",
      "Difficulty": "very easy",
      "Height": "30 - 60cm",
      "Growth": "fast",
      "pH value": "6 - 8",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "2 - 21°dKH",
      "Propagation": "Runners",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vallisneria-spiralis",
    "name": "Vallisneria spiralis",
    "url": "https://www.aquasabi.com/Vallisneria-spiralis",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "The \"eelgrass\", Vallisneria spiralis, is one of the longest known, yet popular aquarium plants. This submerged plant has a wide distribution in Africa and the warmer parts of Europe and Asia. It forms dense, extended stands in lakes and rivers by its runners. The strap-shaped leaves are light to medium green, slightly transparent and about 5-15 mm wide. They vary greatly in length, one may expect a maximum length of 60 cm or more. Besides straight-leaved plants there are also forms with spirally twisted leaves. However this species is not named after such leaves but after the stalks of the female flowers that twist after flowering, as well as in other Vallisneria species. Also typical of the genus, long runners with \"chains\" of numerous plants arise from the leaf rosettes.",
      "notes": "Vallisneria spiralis is one of the \"classic\" aquarium plants, known in the hobby since the beginnings of aquaristics. In nature it is distributed in stagnant and flowing waters in Africa, Asia and the warmer regions of Europe (e.g. Italy). Its species name \"spiralis\" does not refer to its leaf form but to its flower stalk, which starts spiralling after the female flower has withered (as it does in all Vallisneria species). Thus the infrutescence is drawn downward.The plants sold as V. spiralis in trade can grow to very different lengths. However, in most cases plants with smooth (not spiralling) relatively narrow leaves are labeled V. spiralis. So-called \"V. spiralis\" imported from Malaysia have been identified as Vallisneria denseserrulata, a species native to Asia, recently differentiated from V. spiralis but very hard to know apart without flowers.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Vallisnéria spirális L.",
      "Family": "Hydrocharitaceae",
      "Genus": "Vallisneria",
      "Difficulty": "very easy",
      "Usage": "Background",
      "Growth": "fast",
      "pH value": "6 - 8",
      "Temperature tolerance": "5 - 30°C",
      "Carbonate hardness": "2 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Runners",
      "Can grow emersed?": "no",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "very_hard"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vesicularia-Christmas-Moss",
    "name": "Vesicularia \"Christmas Moss\"",
    "url": "https://www.aquasabi.com/Vesicularia-Christmas-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "A very beautiful densely ramified moss specialty. According to information provided by Tropica it originates from Brazil. In Japan it is called \"Amazonia Willow moss\". This moss is a great epiphytic plant on hardscape, to which it attaches, thus bringing a very natural feel to an aquascape.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vesicularia-cf-montagnei-Krabi",
    "name": "Vesicularia cf. montagnei \"Krabi\"",
    "url": "https://www.aquasabi.com/Vesicularia-cf-montagnei-Krabi",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Vesicularia cf. montagnei \"Krabi\" is a creeping, finely ramified moss, found in the calcium-rich waters near Krabi in southern Thailand. It looks more delicate than standard Christmas moss (Vesicularia montagnei) and is very similar to the so-named \"Mini Christmas Moss\", however it has a firmer structure. Its species belonging is still unclear; it is probably closely related to Vesicularia montagnei.",
      "notes": "This moss was discovered in one of the calcareous lakes near Krabi in the south of Thailand. Bryologist Prof. Benito C. Tan (Singapore) found out that it is related to Vesicularia montagnei but wasn't able to determine its exact species.It looks very much like the moss called Vesicularia sp. \"Mini Christmas Moss\" in this database, however, its shoots are more rigid. Vesicularia cf. montagnei \"Krabi\" has dense, regularly branching delicate shoots that attach to rocks and driftwood with the help of their rhizoids. It comes from a lake with a high carboate hardnessa and thus does well in hardwater tanks.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Hypnaceae",
      "Genus": "Vesicularia",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Plant for spawning, Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 8",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 21°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vesicularia-ferriei-Weeping-Moss",
    "name": "Vesicularia ferriei 'Weeping Moss'",
    "url": "https://www.aquasabi.com/Vesicularia-ferriei-Weeping-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "Vesicularia ferriei 'Weeping' is said to originate from China. It was distributed by Oriental Aquarium Plants verbreitet. 'Weeping' is a strong overhanging densely ramified moss. Its emerged form has some upright shots, under water \"Weeping moss\" develops its characteristic overhanging growth habit. This moss is especially suitable for attaching it to decorative driftwood, as it brings depth and contrast to any layout. Please note that the shoots of this moss hardly attach themselves to the substrate. Weeping moss is easy to care for and grows relatively fast. It needs trimming from time to time to maintain its special appearance.",
      "notes": "\"Weeping Moss\" is said to have been imported from China. It was identified as Vesicularia ferrei by Prof. B.C. Tan (Singapore). This species is also distributed in the south of Japan. In nature it has a creeping habit and grows on wet rocks covered with sandy soil, on moist riverbanks and on wet soil on rivulets. (1). The submersed form of this moss can be identified on its clearly overhanging frondshaped shoots (see photos) that remind of a weeping willow. The leaves and the relatively broad leaf cells look rather ike those of V. montagnei (\"Christmas moss\"), however, the leaves do not end in an acuminate tip but are more acute and relatively obtuse. V. montagnei as well as other Vesicularia species may also develop overhanging shoots, but not as bent as those of V. ferriei, whose shoots are clearly bent downward. (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Complete botanical name": "Vesiculária ferriei (Cardot & Thér.) Broth.",
      "Family": "Hypnaceae",
      "Genus": "Vesicularia",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vesicularia-sp-Mini-Christmas-Moss",
    "name": "Vesicularia sp. \"Mini Christmas Moss\"",
    "url": "https://www.aquasabi.com/Vesicularia-sp-Mini-Christmas-Moss",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "This attractive moss has a very bushy growth habit, yet remains quite delicate. We got it under the name \"Mini Taiwan moss\" (Isopterygium sp.), but we found that it is another moss that belongs to the genus Vesicularia. It resembles \"Christmas moss\" very closely, but it is much more delicate and stays smaller. This moss develops dense, regularly ramifying shoots with almost rectangular lateral shoots. Mini Christmas moss attaches readily to rocks and driftwood and is thus ideal for accentuating hardscape materials. It can be used in many ways.",
      "notes": "The moss called \"Mini Christmas Moss\" in this database was spread in the hobby under the name \"Mini Taiwan Moss\", however, it does not belong to Isopterygium sp. (for further detail, please see www.aquamoss.net). It might be a species of the genus Vesicularia. Its origins are unknown. It may also be in trade under other names.This moss looks like a miniature version of Christmas Moss (Vesicularia montagnei). It forms densely and regularly ramified filigree shoots with a triangular outline. It also resembles Vesicularia sp. \"Triangle Moss\", however, it differs by horizontal to overhanging shoots that never grow upwards. It is not clear yet whether it differs from Vesicularia sp. \"Anchor Moss\" and a Vesicularia species sold as \"China Moss\", and if so, in which way.- To be continued - (read more)",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "Family": "Hypnaceae",
      "Genus": "Vesicularia",
      "Difficulty": "medium",
      "Usage": "Epiphyte (growing on hardscape), Nano tanks",
      "Growth": "slow",
      "pH value": "5 - 7",
      "Temperature tolerance": "15 - 30°C",
      "Carbonate hardness": "0 - 14°dKH",
      "General hardness": "0 - 30°dGH",
      "Propagation": "Splitting, cutting off daughter plants",
      "Can grow emersed?": "yes",
      "Source": "Flowgrow",
      "placement": "foreground",
      "difficulty": "medium"
    },
    "listingType": "aquasabi"
  },
  {
    "id": "Vesicularia-sp-Tortoise",
    "name": "Vesicularia sp. \"Tortoise\"",
    "url": "https://www.aquasabi.com/Vesicularia-sp-Tortoise",
    "images": [],
    "rawImages": [],
    "details": {
      "description": "We have found this delicate, creeping to hanging moss on a Bucephalandra that was imported as B. sp. \"Tortoise\", therefore our provisional name. It is very likely a Vesicularia species, but its closer determination is still pending. In its underwater form, it develops a very flat, creeping carpet on hard materials. Loose shoots grow hanging down comparable to to the Weeping moss, Vesicularia ferriei. In contrast to that, \"Tortoise\" has a finer texture and smaller, about 1 mm long leaflets, similar to the \"Mini Christmas moss\". Additionally, it clings better to the substrate than the Weeping moss. Certainly this moss occurs the habitats of Bucephalandra species on Borneo, on rock in the flooding zone of streams, adapted to strong water current.",
      "notes": "",
      "maintenance": "Please choose a variant to see more information."
    },
    "traits": {
      "placement": "foreground"
    },
    "listingType": "aquasabi"
  }
]